<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <!-- redirect begin -->
  <!-- redirect end -->
  
  <meta name="renderer" content="webkit">
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <link rel="dns-prefetch" href="https://monkeysayhi.github.io">
  <title>事务的ACID和四个隔离级别 | 程序猿说你好</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x5728;&amp;#x5B9E;&amp;#x9645;&amp;#x7684;&amp;#x4E1A;&amp;#x52A1;&amp;#x573A;&amp;#x666F;&amp;#x4E2D;&amp;#xFF0C;&amp;#x5E76;&amp;#x53D1;&amp;#x8BFB;&amp;#x5199;&amp;#x5F15;&amp;#x51FA;&amp;#x4E86;&amp;#x4E8B;&amp;#x52A1;&amp;#x63A7;&amp;#x5236;&amp;#x7684;&amp;#x9700;&amp;#x6C42;&amp;#x3002;">
<meta property="og:type" content="article">
<meta property="og:title" content="事务的ACID和四个隔离级别">
<meta property="og:url" content="https://monkeysayhi.github.io/2016/11/26/事务的ACID和四个隔离级别/index.html">
<meta property="og:site_name" content="程序猿说你好">
<meta property="og:description" content="&amp;#x5728;&amp;#x5B9E;&amp;#x9645;&amp;#x7684;&amp;#x4E1A;&amp;#x52A1;&amp;#x573A;&amp;#x666F;&amp;#x4E2D;&amp;#xFF0C;&amp;#x5E76;&amp;#x53D1;&amp;#x8BFB;&amp;#x5199;&amp;#x5F15;&amp;#x51FA;&amp;#x4E86;&amp;#x4E8B;&amp;#x52A1;&amp;#x63A7;&amp;#x5236;&amp;#x7684;&amp;#x9700;&amp;#x6C42;&amp;#x3002;">
<meta property="og:updated_time" content="2018-03-06T04:07:05.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="事务的ACID和四个隔离级别">
<meta name="twitter:description" content="&amp;#x5728;&amp;#x5B9E;&amp;#x9645;&amp;#x7684;&amp;#x4E1A;&amp;#x52A1;&amp;#x573A;&amp;#x666F;&amp;#x4E2D;&amp;#xFF0C;&amp;#x5E76;&amp;#x53D1;&amp;#x8BFB;&amp;#x5199;&amp;#x5F15;&amp;#x51FA;&amp;#x4E86;&amp;#x4E8B;&amp;#x52A1;&amp;#x63A7;&amp;#x5236;&amp;#x7684;&amp;#x9700;&amp;#x6C42;&amp;#x3002;">
  
    <link rel="alternative" href="/atom.xml" title="程序猿说你好" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" href="/main.css">
  
<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-89666809-1', 'auto');
ga('send', 'pageview');

</script>
<!-- End Google Analytics -->


</head>

<body>
  <div id="container">
    <div class="left-col">
      <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/avatar.jpg" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">猴子007</a></h1>
		</hgroup>

		
		<p class="header-subtitle">来了就是猿</p>
		

		<nav class="header-menu">
			<ul>
			
				<li><a href="/">主页</a></li>
	        
				<li><a href="/archives/">时间线</a></li>
	        
			</ul>
		</nav>
		<nav class="header-smart-menu">
	        
    		
    			
    			<a class="js-smart-menu" data-idx="0" href="javascript:void(0)">所有文章</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="1" href="javascript:void(0)">标签</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="2" href="javascript:void(0)">友链</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="3" href="javascript:void(0)">关于我</a>
    			
    			
            
		</nav>
		<nav class="header-nav">
			<div class="social">
				
					<a class="github" target="_blank" href="https://github.com/monkeysayhi" title="github"><i class="icon-github"></i></a>
		        
					<a class="rss" target="_blank" href="/atom.xml" title="rss"><i class="icon-rss"></i></a>
		        
					<a class="mail" target="_blank" href="mailto:monkeysayhi@163.com" title="mail"><i class="icon-mail"></i></a>
		        
			</div>
		</nav>
	</header>		
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"><i class="icon-sort"></i></div>
  		<h1 class="header-author js-mobile-header hide">猴子007</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				
					<img src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/avatar.jpg" class="js-avatar">
				
			</div>
			<hgroup>
			  <h1 class="header-author">猴子007</h1>
			</hgroup>
			
			<p class="header-subtitle">来了就是猿</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives/">时间线</a></li>
		        
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/monkeysayhi" title="github"><i class="icon-github"></i></a>
			        
						<a class="rss" target="_blank" href="/atom.xml" title="rss"><i class="icon-rss"></i></a>
			        
						<a class="mail" target="_blank" href="mailto:monkeysayhi@163.com" title="mail"><i class="icon-mail"></i></a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap">
        <article id="post-事务的ACID和四个隔离级别" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      事务的ACID和四个隔离级别
    </h1>
  

        <a href="/2016/11/26/事务的ACID和四个隔离级别/" class="archive-article-date">
  	<time datetime="2016-11-25T16:34:15.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-11-26</time>
</a>

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x5728;&#x5B9E;&#x9645;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x5E76;&#x53D1;&#x8BFB;&#x5199;&#x5F15;&#x51FA;&#x4E86;&#x4E8B;&#x52A1;&#x63A7;&#x5236;&#x7684;&#x9700;&#x6C42;&#x3002;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x4E8B;&#x52A1;&#x7684;ACID&#x548C;&#x9694;&#x79BB;&#x6027;&#x7684;4&#x4E2A;&#x7EA7;&#x522B;&#x3002;</p>
<a id="more"></a>
<h1 id="ACID"><a href="#ACID" class="headerlink" title="ACID"></a>ACID</h1><p>&#x4E8B;&#x52A1;&#x6307;<code>&quot;&#x4E00;&#x4E2A;&#x88AB;&#x89C6;&#x4E3A;&#x5355;&#x4E00;&#x7684;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#x7684;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&quot;</code>&#x3002;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x56DB;&#x4E2A;&#x6807;&#x51C6;&#x7279;&#x6027;&#xFF0C;&#x5373;<strong><code>ACID</code></strong>&#xFF1A;</p>
<ul>
<li><strong>&#x539F;&#x5B50;&#x6027;&#xFF08;Atomicity&#xFF09;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x88AB;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x6700;&#x5C0F;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#xFF0C;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x63D0;&#x4EA4;&#x6210;&#x529F;&#xFF0C;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x5931;&#x8D25;&#x56DE;&#x6EDA;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6765;&#x8BF4;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x53EA;&#x6267;&#x884C;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x64CD;&#x4F5C;&#x3002;</li>
<li><strong>&#x4E00;&#x81F4;&#x6027;&#xFF08;Consistency&#xFF09;</strong>&#xFF1A;&#x6570;&#x636E;&#x5E93;&#x603B;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x72B6;&#x6001;&#x3002;</li>
<li><strong>&#x9694;&#x79BB;&#x6027;&#xFF08;Isolation&#xFF09;</strong>&#xFF1A;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6240;&#x505A;&#x7684;&#x4FEE;&#x6539;&#x5728;&#x6700;&#x7EC8;&#x63D0;&#x4EA4;&#x4EE5;&#x524D;&#xFF0C;&#x5BF9;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#xFF0C;<em>&#x9694;&#x79BB;&#x6027;&#x5206;&#x4E3A;4&#x4E2A;&#x7EA7;&#x522B;&#xFF1A;&#x8BFB;&#x672A;&#x63D0;&#x4EA4;&#x3001;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x3001;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x3001;&#x4E32;&#x884C;&#x5316;&#x3002;&#x89C1;&#x4E0B;</em>&#x3002;</li>
<li><strong>&#x6301;&#x4E45;&#x6027;&#xFF08;Durability&#xFF09;</strong>&#xFF1A;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x65E6;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#xFF0C;&#x5219;&#x5176;&#x6240;&#x505A;&#x7684;&#x4FEE;&#x6539;&#x4F1A;&#x6C38;&#x4E45;&#x4FDD;&#x5B58;&#x5230;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x5373;&#x4F7F;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#xFF0C;&#x4FEE;&#x6539;&#x7684;&#x6570;&#x636E;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#xFF09;&#x3002;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#xFF0C;&#x6301;&#x4E45;&#x6027;&#x4E5F;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x7EA7;&#x522B;&#xFF0C;&#x6B64;&#x5904;&#x7565;&#x3002;</li>
</ul>
<h1 id="&#x9694;&#x79BB;&#x6027;&#x7684;4&#x4E2A;&#x7EA7;&#x522B;"><a href="#&#x9694;&#x79BB;&#x6027;&#x7684;4&#x4E2A;&#x7EA7;&#x522B;" class="headerlink" title="&#x9694;&#x79BB;&#x6027;&#x7684;4&#x4E2A;&#x7EA7;&#x522B;"></a>&#x9694;&#x79BB;&#x6027;&#x7684;4&#x4E2A;&#x7EA7;&#x522B;</h1><p>&#x5728;&#x7406;&#x89E3;&#x9694;&#x79BB;&#x6027;&#x7EA7;&#x522B;&#x65F6;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x6DF7;&#x6DC6;&#x201C;<code>&#x5E7B;&#x8BFB;</code>&#x201D;&#x4E0E;&#x201C;<code>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</code>&#x201D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x91CC;&#x5148;&#x5BF9;4&#x4E2A;&#x9694;&#x79BB;&#x6027;&#x7EA7;&#x522B;&#x7ED9;&#x51FA;&#x6982;&#x89C8;&#xFF1B;&#x7136;&#x540E;&#x5206;&#x6790;&#x539F;&#x7406;&#xFF0C;&#x4ECE;&#x5B9E;&#x73B0;&#x89D2;&#x5EA6;&#x7406;&#x89E3;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF1B;&#x6700;&#x540E;&#x4F5C;&#x51FA;&#x603B;&#x7ED3;&#x3002;</p>
<h2 id="&#x6982;&#x89C8;"><a href="#&#x6982;&#x89C8;" class="headerlink" title="&#x6982;&#x89C8;"></a>&#x6982;&#x89C8;</h2><p>&#x5173;&#x6CE8;&#x9694;&#x79BB;&#x6027;&#x7684;4&#x4E2A;&#x7EA7;&#x522B;&#xFF0C;&#x5305;&#x62EC;<code>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;</code>&#xFF08;Read Uncommitted&#xFF09;&#x3001;<code>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</code>&#xFF08;Read Committed&#xFF09;&#x3001;<code>&#x53EF;&#x91CD;&#x590D;&#x8BFB;</code>&#xFF08;Repeatable Read&#xFF09;&#x3001;<code>&#x53EF;&#x5E8F;&#x5217;&#x5316;</code>&#xFF08;Serializable&#xFF09;&#xFF1B;&#x53CA;&#x5176;&#x5BF9;&#x5E94;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5305;&#x62EC;<code>&#x810F;&#x8BFB;</code>&#xFF08;Dirty Read&#xFF09;&#x3001;<code>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</code>&#xFF08;Nonrepeatble Read&#xFF09;&#x3001;<code>&#x5E7B;&#x8BFB;</code>&#xFF08;Phantom Read&#xFF09;&#x3002;</p>
<h3 id="&#x8BFB;&#x672A;&#x63D0;&#x4EA4;"><a href="#&#x8BFB;&#x672A;&#x63D0;&#x4EA4;" class="headerlink" title="&#x8BFB;&#x672A;&#x63D0;&#x4EA4;"></a>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;</h3><p><strong>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;</strong>&#x662F;&#x6570;&#x636E;&#x5E93;&#x5E94;&#x4FDD;&#x8BC1;&#x7684;&#x6700;&#x4F4E;&#x7684;&#x9694;&#x79BB;&#x6027;&#x7EA7;&#x522B;&#xFF1A;<strong>&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x5373;&#x4F7F;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#xFF0C;&#x5BF9;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x4E5F;&#x90FD;&#x662F;&#x53EF;&#x89C1;&#x7684;</strong>&#x3002;</p>
<p>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;&#x9762;&#x4E34;<strong>&#x810F;&#x8BFB;</strong>&#x7684;&#x95EE;&#x9898;&#xFF1A;<em>&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x8BE5;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5728;&#x672A;&#x6765;&#x56E0;&#x56DE;&#x6EDA;&#x800C;&#x6D88;&#x5931;</em>&#x3002;&#x4ECE;&#x6027;&#x80FD;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x8BFB;&#x672A;&#x63D0;&#x4EA4;&#x4E0D;&#x4F1A;&#x6BD4;&#x5176;&#x4ED6;&#x7684;&#x7EA7;&#x522B;&#x597D;&#x592A;&#x591A;&#xFF0C;&#x4F46;&#x5374;&#x7F3A;&#x4E4F;&#x5176;&#x4ED6;&#x7EA7;&#x522B;&#x7684;&#x5F88;&#x591A;&#x597D;&#x5904;&#x3002;&#x9664;&#x975E;&#x771F;&#x7684;&#x6709;&#x975E;&#x5E38;&#x5FC5;&#x8981;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;"><a href="#&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;" class="headerlink" title="&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;"></a>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</h3><p><strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x6EE1;&#x8DB3;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x9694;&#x79BB;&#x6027;&#x7684;&#x7B80;&#x5355;&#x5B9A;&#x4E49;&#xFF1A;<strong>&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6240;&#x505A;&#x7684;&#x4FEE;&#x6539;&#x5728;&#x6700;&#x7EC8;&#x63D0;&#x4EA4;&#x4EE5;&#x524D;&#xFF0C;&#x5BF9;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;</strong>&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;<strong>&#x4E00;&#x65E6;&#x63D0;&#x4EA4;&#xFF0C;&#x8BE5;&#x4E8B;&#x52A1;&#x6240;&#x4F5C;&#x7684;&#x4FEE;&#x6539;&#x5BF9;&#x5176;&#x4ED6;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x5C31;&#x662F;&#x53EF;&#x89C1;&#x7684;</strong>&#x3002;</p>
<p>&#x72ED;&#x4E49;&#x4E0A;&#xFF0C;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x89E3;&#x51B3;&#x4E86;&#x810F;&#x8BFB;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E2A;&#x7EA7;&#x522B;&#x6709;&#x65F6;&#x5019;&#x53EB;&#x505A;<strong>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</strong>&#xFF0C;&#x9762;&#x4E34;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x95EE;&#x9898;&#xFF1A;<em>&#x4E24;&#x6B21;&#x6267;&#x884C;&#x540C;&#x6837;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x5982;&#x679C;&#x7B2C;&#x4E8C;&#x6B21;&#x8BFB;&#x5230;&#x4E86;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5219;&#x4F1A;&#x5F97;&#x5230;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x7ED3;&#x679C;</em>&#x3002;</p>
<blockquote>
<p>&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9ED8;&#x8BA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x90FD;&#x662F;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#xFF0C;&#x4F46;MySQL&#x4E0D;&#x662F;&#x3002;</p>
</blockquote>
<h3 id="&#x53EF;&#x91CD;&#x590D;&#x8BFB;"><a href="#&#x53EF;&#x91CD;&#x590D;&#x8BFB;" class="headerlink" title="&#x53EF;&#x91CD;&#x590D;&#x8BFB;"></a>&#x53EF;&#x91CD;&#x590D;&#x8BFB;</h3><p>&#x5728;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;<strong>&#x53EF;&#x91CD;&#x590D;&#x8BFB;</strong>&#x89E3;&#x51B3;&#x4E86;&#x90E8;&#x5206;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x7684;&#x95EE;&#x9898;&#xFF1A;<strong>&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x591A;&#x6B21;&#x8BFB;&#x53D6;&#x540C;&#x6837;&#x8BB0;&#x5F55;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x81F4;&#x7684;</strong>&#x3002;<strong>&#x8BB0;&#x5F55;</strong>&#x6307;&#x5177;&#x4F53;&#x7684;&#x6570;&#x636E;&#x884C;&#x3002;</p>
<p>&#x672A;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x90A3;&#x90E8;&#x5206;&#x79F0;&#x4E3A;<strong>&#x5E7B;&#x8BFB;</strong>&#xFF1A;<em>&#x5F53;&#x67D0;&#x4E2A;&#x4E8B;&#x52A1;&#x5728;&#x8BFB;&#x53D6;&#x76EE;&#x6807;<strong>&#x8303;&#x56F4;</strong>&#x5185;&#x7684;&#x8BB0;&#x5F55;&#x65F6;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53C8;&#x5728;&#x8BE5;&#x8303;&#x56F4;&#x5185;<strong>&#x63D2;&#x5165;</strong>&#x4E86;&#x65B0;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x5F53;&#x4E4B;&#x524D;&#x7684;&#x4E8B;&#x52A1;&#x518D;&#x6B21;&#x8BFB;&#x53D6;&#x8BE5;&#x8303;&#x56F4;&#x7684;&#x8BB0;&#x5F55;&#x65F6;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x7B2C;&#x4E00;&#x6B21;&#x8BFB;&#x53D6;&#x8303;&#x56F4;&#x65F6;&#x4E0D;&#x5B58;&#x5728;&#x7684;<strong><code>&#x5E7B;&#x884C;</code></strong>&#xFF08;Phantom Row&#xFF09;</em>&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;<strong>&#x53EA;&#x6709;&#x63D2;&#x5165;&#x4F1A;&#x4EA7;&#x751F;&#x5E7B;&#x884C;</strong>&#x3002;</p>
<blockquote>
<p>MySQL&#x7684;&#x9ED8;&#x8BA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x662F;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x6709;&#x5E7B;&#x8BFB;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<h3 id="&#x53EF;&#x5E8F;&#x5217;&#x5316;"><a href="#&#x53EF;&#x5E8F;&#x5217;&#x5316;" class="headerlink" title="&#x53EF;&#x5E8F;&#x5217;&#x5316;"></a>&#x53EF;&#x5E8F;&#x5217;&#x5316;</h3><p><strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;</strong>&#x662F;&#x6700;&#x9AD8;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF1A;<strong>&#x5F3A;&#x5236;&#x4E8B;&#x52A1;&#x5E8F;&#x5217;&#x5316;&#x6267;&#x884C;</strong>&#x3002;</p>
<p>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x89E3;&#x51B3;&#x4E86;&#x5E7B;&#x8BFB;&#x95EE;&#x9898;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;<em>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x4F1A;&#x5728;&#x76EE;&#x6807;<strong>&#x8303;&#x56F4;</strong>&#x52A0;&#x72EC;&#x5360;&#x9501;&#xFF0C;&#x5C06;&#x5E76;&#x53D1;&#x8BFB;&#x5199;&#x76F8;&#x540C;&#x8303;&#x56F4;&#x6570;&#x636E;&#x7684;&#x8BF7;&#x6C42;&#x5E8F;&#x5217;&#x5316;</em>&#x3002;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x4F1A;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x7684;&#x8D85;&#x65F6;&#x548C;&#x9501;&#x4E89;&#x7528;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x5F88;&#x5C11;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x975E;&#x5E38;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x6CA1;&#x6709;&#x5E76;&#x53D1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x624D;&#x8003;&#x8651;&#x91C7;&#x7528;&#x8BE5;&#x7EA7;&#x522B;&#x3002;</p>
<h2 id="&#x539F;&#x7406;"><a href="#&#x539F;&#x7406;" class="headerlink" title="&#x539F;&#x7406;"></a>&#x539F;&#x7406;</h2><p>&#x8BA8;&#x8BBA;<code>&#x57FA;&#x4E8E;&#x9501;&#x7684;&#x5E76;&#x53D1;&#x63A7;&#x5236;</code>&#x4E2D;&#xFF0C;4&#x79CD;&#x9694;&#x79BB;&#x6027;&#x7EA7;&#x522B;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x3002;&#x91CD;&#x70B9;&#x5173;&#x6CE8;<code>&#x8BFB;&#x9501;</code>&#xFF08;read lock&#xFF09;&#x3001;<code>&#x5199;&#x9501;</code>&#xFF08;write lock&#xFF0C;&#x6216;&#x79F0;&#x6392;&#x5B83;&#x9501;&#xFF09;&#x3001;<code>&#x8303;&#x56F4;&#x9501;</code>&#xFF08;range lock&#xFF09;&#x3001;&#x9501;&#x7684;&#x6301;&#x6709;&#x65F6;&#x95F4;&#x7B49;&#x6982;&#x5FF5;&#x3002;</p>
<h3 id="&#x8BFB;&#x672A;&#x63D0;&#x4EA4;-1"><a href="#&#x8BFB;&#x672A;&#x63D0;&#x4EA4;-1" class="headerlink" title="&#x8BFB;&#x672A;&#x63D0;&#x4EA4;"></a>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;</h3><p>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x5B9E;&#x73B0;&#xFF1A;<strong>&#x8BFB;&#x9501;&#x3001;&#x5199;&#x9501;&#x90FD;&#x5728;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF08;&#x5982;select&#x3001;insert&#x7B49;&#xFF09;&#x5B8C;&#x6210;&#x540E;&#x7ACB;&#x5373;&#x91CA;&#x653E;</strong>&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E8B;&#x52A1;&#x4F5C;&#x51FA;&#x66F4;&#x65B0;&#x540E;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x5426;&#x63D0;&#x4EA4;&#xFF0C;&#x7531;&#x4E8E;&#x5DF2;&#x7ECF;&#x91CA;&#x653E;&#x4E86;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x7684;&#x5199;&#x9501;&#xFF0C;&#x66F4;&#x65B0;&#x5BF9;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x5C31;&#x662F;&#x53EF;&#x89C1;&#x7684;&#x3002;</p>
<p>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;&#x5B58;&#x5728;&#x810F;&#x8BFB;&#x95EE;&#x9898;&#xFF0C;&#x5047;&#x8BBE;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#xFF1A;</p>
<ol>
<li>&#x4E8B;&#x52A1;1&#x5F00;&#x59CB;</li>
<li>&#x4E8B;&#x52A1;1&#x8BFB;&#x53D6;&#x76EE;&#x6807;&#x8BB0;&#x5F55;</li>
<li>&#x4E8B;&#x52A1;2&#x5F00;&#x59CB;</li>
<li>&#x4E8B;&#x52A1;2&#x4FEE;&#x6539;&#x76EE;&#x6807;&#x8BB0;&#x5F55;</li>
<li>&#x4E8B;&#x52A1;1&#x8BFB;&#x53D6;&#x76EE;&#x6807;&#x8BB0;&#x5F55;</li>
<li>&#x4E8B;&#x52A1;2&#x56DE;&#x6EDA;</li>
<li>&#x4E8B;&#x52A1;1&#x63D0;&#x4EA4;</li>
</ol>
<p>&#x64CD;&#x4F5C;5&#x4E2D;&#xFF0C;&#x4E8B;&#x52A1;1&#x8BFB;&#x5230;&#x4E86;&#x4E8B;&#x52A1;2&#x4FEE;&#x6539;&#x4F46;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x7136;&#x540E;&#x4E8B;&#x52A1;2&#x56DE;&#x6EDA;&#x5BFC;&#x81F4;&#x4FEE;&#x6539;&#x4E22;&#x5931;&#xFF0C;&#x4E5F;&#x5C31;&#x79F0;&#x4E8B;&#x52A1;1&#x8BFB;&#x5230;&#x4E86;&#x201C;&#x810F;&#x6570;&#x636E;&#x201D;&#xFF0C;&#x5373;&#x810F;&#x8BFB;&#x3002;</p>
<blockquote>
<p>&#x533A;&#x5206;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x4E0E;&#x76EE;&#x6807;&#x8303;&#x56F4;&#xFF08;&#x89C1;&#x540E;&#x6587;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#xFF09;&#xFF1A;</p>
<ul>
<li>&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x6307;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x6570;&#x636E;&#x884C;&#xFF1B;&#x8BFB;&#x9501;&#x3001;&#x5199;&#x9501;&#x53EA;&#x9488;&#x5BF9;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x3002;</li>
<li>&#x76EE;&#x6807;&#x8303;&#x56F4;&#x6307;&#x4E00;&#x4E2A;where&#x8BED;&#x53E5;&#x63CF;&#x8FF0;&#x7684;&#x8303;&#x56F4;&#xFF1B;&#x8303;&#x56F4;&#x9501;&#x9488;&#x5BF9;&#x76EE;&#x6807;&#x8303;&#x56F4;&#xFF0C;&#x89C1;&#x540E;&#x3002;</li>
</ul>
</blockquote>
<h3 id="&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;-1"><a href="#&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;-1" class="headerlink" title="&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;"></a>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</h3><p>&#x51FA;&#x73B0;&#x810F;&#x8BFB;&#x7684;&#x539F;&#x56E0;&#x662F;&#x5199;&#x9501;&#x7684;&#x6301;&#x6709;&#x65F6;&#x95F4;&#x8FC7;&#x77ED;&#x3002;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x9488;&#x5BF9;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x4F5C;&#x51FA;&#x4E86;&#x4F18;&#x5316;&#xFF1A;<strong>&#x8BFB;&#x9501;&#x4ECD;&#x7136;&#x5728;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x540E;&#x7ACB;&#x5373;&#x91CA;&#x653E;&#xFF1B;&#x5199;&#x9501;&#x4ECE;&#x5199;&#x64CD;&#x4F5C;&#x5F00;&#x59CB;&#x6301;&#x6709;&#xFF0C;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x540E;&#x91CA;&#x653E;</strong>&#x3002;&#x4E8B;&#x52A1;&#x4F5C;&#x51FA;&#x66F4;&#x65B0;&#x524D;&#xFF0C;&#x4F1A;&#x5148;&#x7533;&#x8BF7;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x7684;&#x5199;&#x9501;&#xFF0C;&#x5E76;&#x6301;&#x7EED;&#x6301;&#x6709;&#x81F3;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x540E;&#xFF0C;&#x91CA;&#x653E;&#x9501;&#x540E;&#xFF0C;&#x66F4;&#x65B0;&#x5BF9;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x624D;&#x662F;&#x53EF;&#x89C1;&#x7684;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8BFB;&#x672A;&#x63D0;&#x4EA4;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#xFF0C;&#x64CD;&#x4F5C;5&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x4E8B;&#x52A1;2&#x6301;&#x6709;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x7684;&#x5199;&#x9501;&#xFF0C;&#x4E8B;&#x52A1;1&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x4E8B;&#x52A1;2&#x63D0;&#x4EA4;&#x91CA;&#x653E;&#x8BE5;&#x5199;&#x9501;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x810F;&#x8BFB;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x8FD8;&#x5B58;&#x5728;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x95EE;&#x9898;&#x3002;&#x5047;&#x8BBE;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#xFF1A;</p>
<ol>
<li>&#x4E8B;&#x52A1;1&#x5F00;&#x59CB;</li>
<li>&#x4E8B;&#x52A1;1&#x8BFB;&#x53D6;&#x76EE;&#x6807;&#x8BB0;&#x5F55;</li>
<li>&#x4E8B;&#x52A1;2&#x5F00;&#x59CB;</li>
<li>&#x4E8B;&#x52A1;2&#x4FEE;&#x6539;&#x76EE;&#x6807;&#x8BB0;&#x5F55;</li>
<li>&#x4E8B;&#x52A1;2&#x63D0;&#x4EA4;</li>
<li>&#x4E8B;&#x52A1;1&#x4FEE;&#x6539;&#x76EE;&#x6807;&#x8BB0;&#x5F55;</li>
<li>&#x4E8B;&#x52A1;1&#x63D0;&#x4EA4;</li>
</ol>
<p>&#x64CD;&#x4F5C;5&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x4E8B;&#x52A1;2&#x7684;&#x4FEE;&#x6539;&#x5BF9;&#x4E8B;&#x52A1;1&#x53EF;&#x89C1;&#xFF0C;&#x4ECE;&#x800C;&#x64CD;&#x4F5C;6&#x4E2D;&#xFF0C;&#x4E8B;&#x52A1;1&#x4F1A;&#x8BFB;&#x5230;&#x4FEE;&#x6539;&#xFF0C;&#x4E0E;&#x64CD;&#x4F5C;2&#x7684;&#x7ED3;&#x679C;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x6B64;&#x4FEE;&#x6539;&#x7ED3;&#x679C;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#xFF08;&#x5982;&#x6839;&#x636E;&#x64CD;&#x4F5C;2&#x8BFB;&#x53D6;&#x7684;&#x7ED3;&#x679C;&#x505A;&#x4FEE;&#x6539;&#xFF09;&#xFF1B;&#x4F46;&#x662F;&#x4E8B;&#x52A1;1&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x672A;&#x5BF9;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x4F5C;&#x51FA;&#x4EFB;&#x4F55;&#x4FEE;&#x6539;&#xFF0C;&#x56E0;&#x6B64;&#x4E8B;&#x52A1;1&#x8FDB;&#x884C;&#x64CD;&#x4F5C;6&#x65F6;&#x7684;&#x72B6;&#x6001;&#x7406;&#x5E94;&#x4E0E;&#x64CD;&#x4F5C;2&#x540E;&#x4E00;&#x81F4;&#xFF08;&#x56DE;&#x987E;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x8981;&#x6C42;&#xFF09;&#x3002;&#x4EE5;&#x4E0A;&#x5373;&#x4E3A;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x3002;</p>
<blockquote>
<p>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x4E0E;&#x810F;&#x8BFB;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4EA4;&#x53C9;&#x3002;&#x810F;&#x8BFB;&#x4FA7;&#x91CD;&#x8BFB;&#x5230;&#x4E0D;&#x5E94;&#x5B58;&#x5728;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x5F3A;&#x8C03;&#x4E24;&#x6B21;&#x76F8;&#x540C;&#x67E5;&#x8BE2;&#x7684;&#x7ED3;&#x679C;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x63CF;&#x8FF0;&#x653E;&#x5BBD;&#x5230;&#x201C;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x7684;&#x72B6;&#x6001;&#x4E0D;&#x7B26;&#x5408;&#x9884;&#x671F;&#x72B6;&#x6001;&#x201D;&#xFF0C;&#x5982;&#x672C;&#x5E94;&#x8BE5;&#x4E0D;&#x540C;&#xFF0C;&#x5374;&#x8BFB;&#x5230;&#x4E86;&#x76F8;&#x540C;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#x4E5F;&#x662F;&#x7531;&#x4E8E;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<h3 id="&#x53EF;&#x91CD;&#x590D;&#x8BFB;-1"><a href="#&#x53EF;&#x91CD;&#x590D;&#x8BFB;-1" class="headerlink" title="&#x53EF;&#x91CD;&#x590D;&#x8BFB;"></a>&#x53EF;&#x91CD;&#x590D;&#x8BFB;</h3><p>&#x89E3;&#x51B3;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ol>
<li>&#x60B2;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x4E32;&#x884C;&#x5316;</li>
<li>&#x4E50;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x591A;&#x7248;&#x672C; + &#x51B2;&#x7A81;&#x68C0;&#x6D4B;</li>
</ol>
<h4 id="&#x60B2;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x4E32;&#x884C;&#x5316;"><a href="#&#x60B2;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x4E32;&#x884C;&#x5316;" class="headerlink" title="&#x60B2;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x4E32;&#x884C;&#x5316;"></a>&#x60B2;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x4E32;&#x884C;&#x5316;</h4><p>&#x201C;&#x4E32;&#x884C;&#x5316;&#x201D;&#x4E0D;&#x9700;&#x8981;&#x89E3;&#x91CA;&#xFF0C;&#x653E;&#x5F03;&#x5E76;&#x53D1;&#x3001;&#x4E32;&#x884C;&#x6267;&#x884C;&#x5F53;&#x7136;&#x4E0D;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x201C;&#x4E32;&#x884C;&#x5316;&#x201D;&#x7684;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x5B9E;&#x73B0;&#x662F;&#xFF1A;<strong>&#x8BFB;&#x9501;&#x3001;&#x5199;&#x9501;&#x4ECE;&#x8BFB;&#x3001;&#x5199;&#x64CD;&#x4F5C;&#x5F00;&#x59CB;&#x6301;&#x6709;&#xFF0C;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x540E;&#x91CA;&#x653E;</strong>&#x3002;&#x4E0E;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x7684;&#x5B9E;&#x73B0;&#x76F8;&#x6BD4;&#xFF0C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x5EF6;&#x957F;&#x8BFB;&#x9501;&#x7684;&#x6301;&#x6709;&#x65F6;&#x95F4;&#x76F4;&#x5230;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x540E;&#xFF0C;&#x5728;&#x6B64;&#x671F;&#x95F4;&#xFF0C;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x65E0;&#x6CD5;&#x88AB;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#xFF0C;&#x64CD;&#x4F5C;2&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x4E8B;&#x52A1;1&#x5F00;&#x59CB;&#x6301;&#x6709;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x7684;&#x8BFB;&#x9501;&#xFF0C;&#x5BFC;&#x81F4;&#x4E8B;&#x52A1;2&#x7684;&#x64CD;&#x4F5C;4&#x4F1A;&#x9677;&#x5165;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x4E8B;&#x52A1;1&#x63D0;&#x4EA4;&#x91CA;&#x653E;&#x9501;&#x3002;</p>
<blockquote>
<p>&#x201C;&#x4E32;&#x884C;&#x5316;&#x201D;&#x4E0D;&#x540C;&#x4E8E;&#x201C;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x201D;&#x3002;&#x4E3A;&#x4E86;&#x533A;&#x5206;&#xFF0C;&#x524D;&#x3001;&#x540E;&#x6587;&#x4E2D;&#x5747;&#x5C06;&#x9694;&#x79BB;&#x6027;&#x7EA7;&#x522B;&#x79F0;&#x4E3A;&#x201C;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x201D;&#xFF0C;&#x5C06;&#x6B64;&#x5904;&#x7684;&#x60B2;&#x89C2;&#x7B56;&#x7565;&#x79F0;&#x4E3A;&#x201C;&#x4E32;&#x884C;&#x5316;&#x201D;&#x3002;</p>
</blockquote>
<h4 id="&#x4E50;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x591A;&#x7248;&#x672C;-&#x51B2;&#x7A81;&#x68C0;&#x6D4B;"><a href="#&#x4E50;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x591A;&#x7248;&#x672C;-&#x51B2;&#x7A81;&#x68C0;&#x6D4B;" class="headerlink" title="&#x4E50;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x591A;&#x7248;&#x672C; + &#x51B2;&#x7A81;&#x68C0;&#x6D4B;"></a>&#x4E50;&#x89C2;&#x7B56;&#x7565;&#xFF1A;&#x591A;&#x7248;&#x672C; + &#x51B2;&#x7A81;&#x68C0;&#x6D4B;</h4><p>&#x201C;&#x591A;&#x7248;&#x672C; + &#x51B2;&#x7A81;&#x68C0;&#x6D4B;&#x201D;&#x662F;&#x66F4;&#x5E38;&#x89C1;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6848;&#xFF1A;<em>&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x91C7;&#x7528;&#x591A;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x6700;&#x540E;&#x63D0;&#x4EA4;&#x65F6;&#x68C0;&#x6D4B;&#x662F;&#x5426;&#x4E0E;&#x5F53;&#x524D;&#x6570;&#x636E;&#x7248;&#x672C;&#x51B2;&#x7A81;&#xFF0C;&#x5982;&#x679C;&#x51B2;&#x7A81;&#x5219;&#x62A5;&#x9519;&#x63D0;&#x9192;&#xFF0C;&#x5426;&#x5219;&#x6210;&#x529F;&#x63D0;&#x4EA4;</em>&#x3002;</p>
<p>&#x201C;&#x591A;&#x7248;&#x672C; + &#x51B2;&#x7A81;&#x68C0;&#x6D4B;&#x201D;&#x7684;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x5B9E;&#x73B0;&#x662F;&#xFF1A;<strong>&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#x6301;&#x6709;&#x5F53;&#x524D;&#x6570;&#x636E;&#x7684;&#x5FEB;&#x7167;&#xFF0C;&#x8BFB;&#x5199;&#x5747;&#x4E0D;&#x51B2;&#x7A81;&#xFF0C;&#x63D0;&#x4EA4;&#x65F6;&#x68C0;&#x6D4B;&#x4FEE;&#x6539;&#x7684;&#x5FEB;&#x7167;&#x4E0E;&#x5F53;&#x524D;&#x6570;&#x636E;&#x662F;&#x5426;&#x51B2;&#x7A81;</strong>&#x3002;&#x4F7F;&#x7528;&#x4E50;&#x89C2;&#x7684;&#x51B2;&#x7A81;&#x68C0;&#x6D4B;&#x7B56;&#x7565;&#x4EE3;&#x66FF;&#x60B2;&#x89C2;&#x7684;&#x9501;&#x7B56;&#x7565;&#xFF0C;&#x5728;&#x4E2D;&#x4F4E;&#x7A0B;&#x5EA6;&#x7684;&#x5E76;&#x53D1;&#x60C5;&#x51B5;&#x4E0B;&#x6027;&#x80FD;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#xFF0C;&#x4E8B;&#x52A1;1&#x3001;2&#x5404;&#x81EA;&#x6301;&#x6709;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x5FEB;&#x7167;&#xFF0C;&#x5728;&#x64CD;&#x4F5C;4&#x4FEE;&#x6539;&#x81EA;&#x5DF1;&#x7248;&#x672C;&#x7684;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#x540E;&#xFF0C;&#x64CD;&#x4F5C;5&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;2&#xFF0C;&#x68C0;&#x6D4B;&#x4E0D;&#x51B2;&#x7A81;&#xFF08;&#x5047;&#x8BBE;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#xFF09;&#xFF0C;&#x5408;&#x5E76;&#x5230;&#x5F53;&#x524D;&#x6570;&#x636E;&#xFF0C;&#x5F53;&#x524D;&#x6570;&#x636E;&#x5B8C;&#x6210;&#x4FEE;&#x6539;&#xFF1B;&#x7136;&#x540E;&#x64CD;&#x4F5C;6&#x7EE7;&#x7EED;&#x4FEE;&#x6539;&#x81EA;&#x5DF1;&#x7248;&#x672C;&#x7684;&#x76EE;&#x6807;&#x8BB0;&#x5F55;&#xFF0C;&#x64CD;&#x4F5C;7&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;1&#xFF0C;&#x53D1;&#x73B0;&#x4E0E;&#x5F53;&#x524D;&#x6570;&#x636E;&#x51B2;&#x7A81;&#xFF0C;&#x7ED9;&#x51FA;&#x62A5;&#x9519;&#x3002;</p>
<h4 id="&#x5E7B;&#x8BFB;&#x95EE;&#x9898;"><a href="#&#x5E7B;&#x8BFB;&#x95EE;&#x9898;" class="headerlink" title="&#x5E7B;&#x8BFB;&#x95EE;&#x9898;"></a>&#x5E7B;&#x8BFB;&#x95EE;&#x9898;</h4><blockquote>
<p>&#x5E7B;&#x8BFB;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x3002;</p>
</blockquote>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x51FA;&#x73B0;&#x5E7B;&#x8BFB;&#x95EE;&#x9898;&#x5462;&#xFF1F;</p>
<p>Java&#x7684;&#x5185;&#x7F6E;&#x9501;&#x4EE5;&#x5BF9;&#x8C61;&#x4E3A;&#x5355;&#x4F4D;&#xFF0C;RDBMS&#x7684;&#x9501;&#x5462;&#xFF1F;&#x524D;&#x9762;&#x7684;&#x6CE8;&#x91CA;&#x4E2D;&#x7565;&#x6709;&#x4ECB;&#x7ECD;&#x3002;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4EE5;&#x6570;&#x636E;&#x8868;&#x3001;&#x6570;&#x636E;&#x5E93;&#x4E3A;&#x5355;&#x4F4D;&#x5B9E;&#x73B0;&#x9501;&#x7684;&#x6027;&#x80FD;&#x8FC7;&#x4F4E;&#xFF1B;&#x6807;&#x51C6;SQL&#x4E2D;&#xFF0C;&#x8BFB;&#x3001;&#x5199;&#x9501;&#x4EE5;&#x8BB0;&#x5F55;&#xFF08;&#x6570;&#x636E;&#x884C;&#xFF09;&#x4E3A;&#x5355;&#x4F4D;&#xFF0C;&#x8303;&#x56F4;&#x9501;&#x4EE5;&#x8303;&#x56F4;&#xFF08;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x7528;where&#x63CF;&#x8FF0;&#xFF09;&#x4E3A;&#x5355;&#x4F4D;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8303;&#x56F4;&#x9501;&#xFF0C;&#x90A3;&#x4E48;&#x663E;&#x7136;&#x8BFB;&#x3001;&#x5199;&#x9501;&#x53EA;&#x80FD;&#x201C;&#x9501;&#x201D;&#x5728;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x8BB0;&#x5F55;&#x4E0A;&#x3002;&#x5047;&#x8BBE;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#xFF0C;&#x8FD9;&#x6B21;&#x5177;&#x4F53;&#x4E00;&#x4E9B;&#xFF1A;</p>
<ol>
<li>&#x4E8B;&#x52A1;1&#x5F00;&#x59CB;</li>
<li>&#x4E8B;&#x52A1;1&#x7EDF;&#x8BA1;&#x8868;&#x5185;&#x6570;&#x636E;&#x7684;&#x603B;&#x884C;&#x6570;</li>
<li>&#x4E8B;&#x52A1;2&#x5F00;&#x59CB;</li>
<li>&#x4E8B;&#x52A1;2&#x63D2;&#x5165;&#x4E00;&#x6761;&#x65B0;&#x7EAA;&#x5F55;</li>
<li>&#x4E8B;&#x52A1;2&#x63D0;&#x4EA4;</li>
<li>&#x4E8B;&#x52A1;1&#x5229;&#x7528;&#x201C;&#x65E7;&#x7684;&#x603B;&#x884C;&#x6570;+&#x65B0;&#x7684;&#x6570;&#x636E;&#x8868;&#x5185;&#x5BB9;&#x201D;&#x8BA1;&#x7B97;&#x533A;&#x5206;&#x5EA6;</li>
<li>&#x4E8B;&#x52A1;1&#x63D0;&#x4EA4;</li>
</ol>
<p>&#x8BE5;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#x662F;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x4E2D;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#x7684;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x5B9E;&#x4F8B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x90E8;&#x5206;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x90A3;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x5E7B;&#x8BFB;&#x4E86;&#x3002;</p>
<p>&#x4EE5;&#x57FA;&#x4E8E;&#x9501;&#x7684;&#x201C;&#x4E32;&#x884C;&#x5316;&#x201D;&#x65B9;&#x6848;&#x4E3A;&#x4F8B;&#xFF08;&#x201C;&#x591A;&#x7248;&#x672C;+&#x5E76;&#x53D1;&#x51B2;&#x7A81;&#x201D;&#x540C;&#x7406;&#xFF09;&#xFF0C;&#x5047;&#x8BBE;&#x4E0D;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x9501;&#xFF0C;&#x5219;&#x5E7B;&#x8BFB;&#x8868;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;&#x7531;&#x4E8E;&#x4E8B;&#x52A1;2&#x63D2;&#x5165;&#x7684;&#x8BB0;&#x5F55;&#x4E0D;&#x83B7;&#x53D6;&#x9501;&#xFF0C;&#x64CD;&#x4F5C;2&#x83B7;&#x53D6;&#x7684;&#x8BFB;&#x9501;&#x65E0;&#x6CD5;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF0C;&#x64CD;&#x4F5C;5&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;2&#x540E;&#xFF0C;&#x65B0;&#x8BB0;&#x5F55;&#x5C31;&#x5BF9;&#x4E8B;&#x52A1;1&#x53EF;&#x89C1;&#x4E86;&#xFF1B;&#x64CD;&#x4F5C;6&#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x4E8B;&#x52A1;1&#x8BA4;&#x4E3A;&#x4E00;&#x81F4;&#x6027;&#x4F9D;&#x7136;&#x6EE1;&#x8DB3;&#xFF0C;&#x4FBF;&#x4F7F;&#x7528;&#x4E86;&#x65E7;&#x7684;&#x603B;&#x884C;&#x6570;&#xFF0C;&#x5E76;&#x91CD;&#x65B0;&#x8BFB;&#x8868;&#x8BA1;&#x7B97;<code>distinct count</code>&#xFF0C;&#x5374;&#x8BFB;&#x5230;&#x4E86;&#x4E00;&#x6761;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x65B0;&#x7EAA;&#x5F55;&#xFF0C;&#x7834;&#x574F;&#x4E86;&#x4E00;&#x81F4;&#x6027;&#x2014;&#x2014;&#x597D;&#x50CF;&#x51FA;&#x73B0;&#x4E86;&#x5E7B;&#x89C9;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x6761;&#x65B0;&#x7EAA;&#x5F55;&#x5C31;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x5E7B;&#x884C;&#x201D;&#xFF0C;&#x8BE5;&#x73B0;&#x8C61;&#x5373;&#x201C;&#x5E7B;&#x8BFB;&#x201D;&#x3002;</p>
<h3 id="&#x53EF;&#x5E8F;&#x5217;&#x5316;-1"><a href="#&#x53EF;&#x5E8F;&#x5217;&#x5316;-1" class="headerlink" title="&#x53EF;&#x5E8F;&#x5217;&#x5316;"></a>&#x53EF;&#x5E8F;&#x5217;&#x5316;</h3><p>&#x5BF9;&#x4E8E;&#x57FA;&#x4E8E;&#x9501;&#x7684;&#x201C;&#x4E32;&#x884C;&#x5316;&#x201D;&#x65B9;&#x6848;&#xFF0C;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x5B9E;&#x73B0;&#xFF1A;<strong>&#x4ECE;&#x5404;&#x64CD;&#x4F5C;&#x5F00;&#x59CB;&#x524D;&#x6301;&#x6709;&#x8BFB;&#x9501;&#x3001;&#x5199;&#x9501;&#x3001;&#x8303;&#x56F4;&#x9501;&#xFF0C;&#x76F4;&#x5230;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x540E;&#x91CA;&#x653E;</strong>&#x3002;&#x5BF9;&#x4E8E;&#x201C;&#x591A;&#x7248;&#x672C; + &#x51B2;&#x7A81;&#x68C0;&#x6D4B;&#x201D;&#x65B9;&#x6848;&#xFF0C;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x57FA;&#x4E8E;&#x66F4;&#x4E25;&#x683C;&#x7684;&#x5199;&#x51B2;&#x7A81;&#x68C0;&#x6D4B;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x8BE6;&#x89C1;&#x201C;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x201D;&#x6280;&#x672F;&#xFF0C;&#x6B64;&#x5904;&#x4E0D;&#x5C55;&#x5F00;&#x3002;</p>
<p>&#x8303;&#x56F4;&#x9501;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x5E7B;&#x8BFB;&#x95EE;&#x9898;&#x5462;&#xFF1F;</p>
<p>&#x8303;&#x56F4;&#x9501;&#x662F;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x6982;&#x5FF5;&#x4E0A;&#x7684;&#x9501;&#xFF0C;<strong>&#x4E8B;&#x52A1;&#x4ECE;&#x8BFB;&#x3001;&#x5199;&#x64CD;&#x4F5C;&#xFF08;&#x5E26;&#x663E;&#x5F0F;&#x6216;&#x9690;&#x5F0F;where&#xFF09;&#x5F00;&#x59CB;&#x524D;&#x6301;&#x6709;&#x8303;&#x56F4;&#x9501;&#xFF0C;&#x76F4;&#x5230;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x540E;&#x91CA;&#x653E;</strong>&#x3002;&#x5FFD;&#x7565;&#x8BFB;&#x3001;&#x5199;&#x9501;&#xFF0C;&#x5BF9;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x4E2D;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#x7684;&#x5F71;&#x54CD;&#x5982;&#x4E0B;&#xFF1A;&#x64CD;&#x4F5C;2&#x4E2D;&#x4E8B;&#x52A1;1&#x83B7;&#x53D6;&#x4E86;&#x76EE;&#x6807;&#x8303;&#x56F4;&#x4E0A;&#x7684;&#x8303;&#x56F4;&#x9501;&#xFF0C;&#x64CD;&#x4F5C;4&#x53D1;&#x73B0;&#x76EE;&#x6807;&#x8303;&#x56F4;&#x88AB;&#x9501;&#xFF0C;&#x9677;&#x5165;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x64CD;&#x4F5C;7&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x3002;</p>
<h2 id="&#x9694;&#x79BB;&#x6027;&#x7EA7;&#x522B;&#x7684;&#x603B;&#x7ED3;"><a href="#&#x9694;&#x79BB;&#x6027;&#x7EA7;&#x522B;&#x7684;&#x603B;&#x7ED3;" class="headerlink" title="&#x9694;&#x79BB;&#x6027;&#x7EA7;&#x522B;&#x7684;&#x603B;&#x7ED3;"></a>&#x9694;&#x79BB;&#x6027;&#x7EA7;&#x522B;&#x7684;&#x603B;&#x7ED3;</h2><p>&#x5404;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x89E3;&#x51B3;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x95EE;&#x9898;&#x3002;&#x201D;Y&#x201D;&#x8BF4;&#x660E;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF0C;&#x201D;-&#x201C;&#x8BF4;&#x660E;&#x4E0D;&#x5B58;&#x5728;&#xFF1A;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x9694;&#x79BB;&#x7EA7;&#x522B;/&#x95EE;&#x9898;</th>
<th style="text-align:center">&#x810F;&#x8BFB;</th>
<th style="text-align:center">&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</th>
<th style="text-align:center">&#x5E7B;&#x8BFB;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">&#x8BFB;&#x672A;&#x63D0;&#x4EA4;</td>
<td style="text-align:center">Y</td>
<td style="text-align:center">Y</td>
<td style="text-align:center">Y</td>
</tr>
<tr>
<td style="text-align:center">&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</td>
<td style="text-align:center">-</td>
<td style="text-align:center">Y</td>
<td style="text-align:center">Y</td>
</tr>
<tr>
<td style="text-align:center">&#x53EF;&#x91CD;&#x590D;&#x8BFB;</td>
<td style="text-align:center">-</td>
<td style="text-align:center">-</td>
<td style="text-align:center">Y</td>
</tr>
<tr>
<td style="text-align:center">&#x53EF;&#x5E8F;&#x5217;&#x5316;</td>
<td style="text-align:center">-</td>
<td style="text-align:center">-</td>
<td style="text-align:center">-</td>
</tr>
</tbody>
</table>
<p>&#x5728;&#x57FA;&#x4E8E;&#x9501;&#x7684;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x4E2D;&#xFF0C;&#x4F9D;&#x9760;&#x4E0D;&#x540C;&#x7684;&#x9501;&#x6301;&#x6709;&#x65F6;&#x95F4;&#x5B9E;&#x73B0;&#x5404;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;&#x9501;&#x5747;&#x4ECE;&#x64CD;&#x4F5C;&#x524D;&#x5F00;&#x59CB;&#x6301;&#x6709;&#xFF0C;&#x201D;S&#x201D;&#x8868;&#x793A;&#x64CD;&#x4F5C;&#x7ED3;&#x675F;&#x540E;&#x91CA;&#x653E;&#xFF0C;&#x201D;C&#x201D;&#x8868;&#x793A;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x540E;&#x91CA;&#x653E;&#xFF1A;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x9694;&#x79BB;&#x7EA7;&#x522B;/&#x95EE;&#x9898;</th>
<th style="text-align:center">&#x5199;&#x9501;</th>
<th style="text-align:center">&#x8BFB;&#x9501;</th>
<th style="text-align:center">&#x8303;&#x56F4;&#x9501;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">&#x8BFB;&#x672A;&#x63D0;&#x4EA4;</td>
<td style="text-align:center">S</td>
<td style="text-align:center">S</td>
<td style="text-align:center">S</td>
</tr>
<tr>
<td style="text-align:center">&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</td>
<td style="text-align:center">C</td>
<td style="text-align:center">S</td>
<td style="text-align:center">S</td>
</tr>
<tr>
<td style="text-align:center">&#x53EF;&#x91CD;&#x590D;&#x8BFB;</td>
<td style="text-align:center">C</td>
<td style="text-align:center">C</td>
<td style="text-align:center">S</td>
</tr>
<tr>
<td style="text-align:center">&#x53EF;&#x5E8F;&#x5217;&#x5316;</td>
<td style="text-align:center">C</td>
<td style="text-align:center">C</td>
<td style="text-align:center">C</td>
</tr>
</tbody>
</table>
<p>MySQL&#x7684;&#x9ED8;&#x8BA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x662F;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x810F;&#x8BFB;&#x3001;&#x90E8;&#x5206;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x5E7B;&#x8BFB;&#x95EE;&#x9898;&#x3002;</p>
<hr>
<blockquote>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="http://www.cnblogs.com/xuanzhi201111/p/4103696.html" target="_blank" rel="external">MySQL ACID&#x53CA;&#x56DB;&#x79CD;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x7684;&#x89E3;&#x91CA;</a></li>
<li><a href="https://zh.wikipedia.org/wiki/%E4%BA%8B%E5%8B%99%E9%9A%94%E9%9B%A2#%E5%8F%AF%E9%87%8D%E5%A4%8D%E8%AF%BB" target="_blank" rel="external">&#x4E8B;&#x52A1;&#x9694;&#x79BB;</a></li>
<li><a href="https://www.zhihu.com/question/23242151/answer/157581965" target="_blank" rel="external">&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x4E0E;&#x9501;&#x673A;&#x5236;&#x6709;&#x4EC0;&#x4E48;&#x5DEE;&#x522B;&#x548C;&#x8054;&#x7CFB;&#xFF0C;&#x6700;&#x8FD1;&#x5728;&#x770B;&#xFF0C;&#x611F;&#x89C9;&#x4E24;&#x4E2A;&#x5F88;&#x6DF7;&#x4E71;~&#x6C42;&#x89E3;&#x91CA;&#x3002;?</a></li>
</ul>
</blockquote>

      

      
        <div class="page-reward">
          <a href="javascript:;" class="page-reward-btn tooltip-top">
            <div class="tooltip tooltip-east">
            <span class="tooltip-item">
              赏
            </span>
            <span class="tooltip-content">
              <span class="tooltip-text">
                <span class="tooltip-inner">
                  <p class="reward-p"><i class="icon icon-quo-left"></i>make a better world for everyone<i class="icon icon-quo-right"></i></p>
                  <div class="reward-box">
                    
                    
                    <div class="reward-box-item">
                      <img class="reward-img" src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/weixin_pay_qr_code.png">
                      <span class="reward-type">微信</span>
                    </div>
                    
                  </div>
                </span>
              </span>
            </span>
          </div>
          </a>
        </div>
      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/事务/">事务</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/原创/">原创</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/数据库/">数据库</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/面试/">面试</a></li></ul>
	</div>

      

      

      
        <div class="share-btn share-icons tooltip-left">
  <div class="tooltip tooltip-east">
    <span class="tooltip-item">
      <a href="javascript:;" class="share-sns share-outer">
        <i class="icon icon-share"></i>
      </a>
    </span>
    <span class="tooltip-content">
      <div class="share-wrap">
        <div class="share-icons">
          <a class="weibo share-sns" href="javascript:;" data-type="weibo">
            <i class="icon icon-weibo"></i>
          </a>
          <a class="weixin share-sns wxFab" href="javascript:;" data-type="weixin">
            <i class="icon icon-weixin"></i>
          </a>
          <a class="qq share-sns" href="javascript:;" data-type="qq">
            <i class="icon icon-qq"></i>
          </a>
          <a class="douban share-sns" href="javascript:;" data-type="douban">
            <i class="icon icon-douban"></i>
          </a>
          <a class="qzone share-sns" href="javascript:;" data-type="qzone">
            <i class="icon icon-qzone"></i>
          </a>
          <a class="facebook share-sns" href="javascript:;" data-type="facebook">
            <i class="icon icon-facebook"></i>
          </a>
          <a class="twitter share-sns" href="javascript:;" data-type="twitter">
            <i class="icon icon-twitter"></i>
          </a>
          <a class="google share-sns" href="javascript:;" data-type="google">
            <i class="icon icon-google"></i>
          </a>
        </div>
      </div>
    </span>
  </div>
</div>

<div class="page-modal wx-share js-wx-box">
    <a class="close js-modal-close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <div class="wx-qrcode"></div>
</div>

<div class="mask js-mask"></div>
      
      <div class="clearfix"></div>
    </div>
  </div>
      
      <!--文章底部-->
      <div style="font-size:12px;border-bottom: #ddd 1px solid; BORDER-LEFT: #ddd 1px solid; BACKGROUND: #f6f6f6; MIN-HEIGHT: 120px; BORDER-TOP: #ddd 1px solid; BORDER-RIGHT: #ddd 1px solid">
	<div style="MARGIN-TOP: 5px; MARGIN-BOTTOM: 5px; FLOAT: left; MARGIN-LEFT: 5px; MARGIN-RIGHT: 10px">
		<div style="text-align:center">
			扫描微信关注我<br>
			<img alt="微信公众号二维码" title="微信公众号二维码" src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/weixin_qr_code.jpg" height="90" />
		</div>
	</div>
	<div style="LINE-HEIGHT: 200%; MARGIN-TOP: 10px; COLOR: #000000">
		本文链接：<a href="/2016/11/26/事务的ACID和四个隔离级别/">事务的ACID和四个隔离级别</a><br/>
		作者：<a title="点击联系我" href="mailto:monkeysayhi@163.com">猴子007</a><br/>
		出处：<a href="/">https://monkeysayhi.github.io</a><br/>
		本文基于<a target="_blank" title="Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)" href="http://creativecommons.org/licenses/by-sa/4.0/"> 知识共享署名-相同方式共享 4.0 </a>国际许可协议发布，欢迎转载，演绎或用于商业目的，但是必须保留本文的署名及链接。
	</div>
</div>
      
</article>

  
<nav id="article-nav">
  
    <a href="/2016/11/27/源码|ThreadLocal的实现原理/" id="article-nav-newer" class="article-nav-link-wrap">
      <i class="icon-circle-left"></i>
      <div class="article-nav-title">
        
          源码|ThreadLocal的实现原理
        
      </div>
    </a>
  
  
    <a href="/2016/11/26/Java内存模型/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">Java内存模型</div>
      <i class="icon-circle-right"></i>
    </a>
  
</nav>









      </div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2019 猴子007
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    <script>
	var yiliaConfig = {
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: "/",
		innerArchive: true
	}
</script>

<script src="/./main.js"></script>






    
<div class="tools-col">
  <ul class="btn-wrap">
    
      <li class="chose" data-hook="tools-section-all"><span class="text">全部</span><i class="icon-book"></i></li>
    
    
      <li data-hook="tools-section-tag"><span class="text">标签</span><i class="icon-price-tags"></i></li>
    
    
      <li data-hook="tools-section-friends"><span class="text">友链</span><i class="icon-link"></i></li>
    
    
      <li data-hook="tools-section-me"><span class="text">我</span><i class="icon-smile"></i></li>
    
  </ul>
  <div class="tools-wrap">
    
    	<section class="tools-section tools-section-all chose">
    	</section>
    

    
    	<section class="tools-section tools-section-tag">
    			<div class="widget tagcloud" id="js-tagcloud">
    				<a href="/tags/HDFS/" style="font-size: 16.15px;">HDFS</a> <a href="/tags/Hadoop/" style="font-size: 16.92px;">Hadoop</a> <a href="/tags/IDEA/" style="font-size: 10px;">IDEA</a> <a href="/tags/JVM/" style="font-size: 15.38px;">JVM</a> <a href="/tags/Java/" style="font-size: 18.46px;">Java</a> <a href="/tags/LintCode/" style="font-size: 13.08px;">LintCode</a> <a href="/tags/Linux/" style="font-size: 12.31px;">Linux</a> <a href="/tags/Mac/" style="font-size: 10px;">Mac</a> <a href="/tags/Python/" style="font-size: 10px;">Python</a> <a href="/tags/TCP/" style="font-size: 10.77px;">TCP</a> <a href="/tags/Yarn/" style="font-size: 11.54px;">Yarn</a> <a href="/tags/test/" style="font-size: 10px;">test</a> <a href="/tags/事务/" style="font-size: 10px;">事务</a> <a href="/tags/分布式/" style="font-size: 12.31px;">分布式</a> <a href="/tags/原创/" style="font-size: 20px;">原创</a> <a href="/tags/并发/" style="font-size: 17.69px;">并发</a> <a href="/tags/数据库/" style="font-size: 10.77px;">数据库</a> <a href="/tags/猿工/" style="font-size: 13.85px;">猿工</a> <a href="/tags/猿格/" style="font-size: 13.85px;">猿格</a> <a href="/tags/生活/" style="font-size: 10px;">生活</a> <a href="/tags/硬件/" style="font-size: 10px;">硬件</a> <a href="/tags/科普/" style="font-size: 12.31px;">科普</a> <a href="/tags/算法/" style="font-size: 13.85px;">算法</a> <a href="/tags/系统设计/" style="font-size: 10px;">系统设计</a> <a href="/tags/索引/" style="font-size: 10px;">索引</a> <a href="/tags/网络/" style="font-size: 10.77px;">网络</a> <a href="/tags/设计模式/" style="font-size: 14.62px;">设计模式</a> <a href="/tags/轮子/" style="font-size: 10px;">轮子</a> <a href="/tags/鉴赏/" style="font-size: 10px;">鉴赏</a> <a href="/tags/随笔/" style="font-size: 10.77px;">随笔</a> <a href="/tags/面试/" style="font-size: 19.23px;">面试</a>
    			</div>
    	</section>
    

    
    	<section class="tools-section tools-section-friends">
  		
  			<div class="friends-wrap" id="js-friends">
  			
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://www.jianshu.com/u/e94a22a2b6f1/">简书</a>
  	        
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="https://juejin.im/user/59cf5ebef265da0672286a9a/">掘金</a>
  	        
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://spy19930412.github.io/">Jane_s_blog</a>
  	        
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://zongwenlong.github.io/">All_is_well</a>
  	        
  	        </div>
  		
    	</section>
    

    
    	<section class="tools-section tools-section-me">
  	  	
  	  		<div class="aboutme-wrap" id="js-aboutme">我是猴子007，&lt;br&gt;一只非常特殊的动物，&lt;br&gt;可以从事程序的开发、维护，&lt;br&gt;经常因寻找香蕉或母猿而无心工作。</div>
  	  	
    	</section>
    
  </div>
  
</div>
    <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>
  </div>
</body>
</html>