<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <!-- redirect begin -->
  <!-- redirect end -->
  
  <meta name="renderer" content="webkit">
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <link rel="dns-prefetch" href="https://monkeysayhi.github.io">
  <title>浅谈偏向锁、轻量级锁、重量级锁 | 程序猿说你好</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x4E3A;&amp;#x4E86;&amp;#x6362;&amp;#x53D6;&amp;#x6027;&amp;#x80FD;&amp;#xFF0C;JVM&amp;#x5728;&amp;#x5185;&amp;#x7F6E;&amp;#x9501;&amp;#x4E0A;&amp;#x505A;&amp;#x4E86;&amp;#x975E;&amp;#x5E38;&amp;#x591A;&amp;#x7684;&amp;#x4F18;&amp;#x5316;&amp;#xFF0C;&amp;#x81A8;&amp;#x80C0;&amp;#x5F0F;&amp;#x76">
<meta property="og:type" content="article">
<meta property="og:title" content="浅谈偏向锁、轻量级锁、重量级锁">
<meta property="og:url" content="https://monkeysayhi.github.io/2018/01/02/浅谈偏向锁、轻量级锁、重量级锁/index.html">
<meta property="og:site_name" content="程序猿说你好">
<meta property="og:description" content="&amp;#x4E3A;&amp;#x4E86;&amp;#x6362;&amp;#x53D6;&amp;#x6027;&amp;#x80FD;&amp;#xFF0C;JVM&amp;#x5728;&amp;#x5185;&amp;#x7F6E;&amp;#x9501;&amp;#x4E0A;&amp;#x505A;&amp;#x4E86;&amp;#x975E;&amp;#x5E38;&amp;#x591A;&amp;#x7684;&amp;#x4F18;&amp;#x5316;&amp;#xFF0C;&amp;#x81A8;&amp;#x80C0;&amp;#x5F0F;&amp;#x76">
<meta property="og:image" content="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/浅谈偏向锁、轻量级锁、重量级锁/锁分配和膨胀过程.png">
<meta property="og:image" content="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/浅谈偏向锁、轻量级锁、重量级锁/简化版锁分配和膨胀过程.png">
<meta property="og:updated_time" content="2018-01-04T02:12:23.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="浅谈偏向锁、轻量级锁、重量级锁">
<meta name="twitter:description" content="&amp;#x4E3A;&amp;#x4E86;&amp;#x6362;&amp;#x53D6;&amp;#x6027;&amp;#x80FD;&amp;#xFF0C;JVM&amp;#x5728;&amp;#x5185;&amp;#x7F6E;&amp;#x9501;&amp;#x4E0A;&amp;#x505A;&amp;#x4E86;&amp;#x975E;&amp;#x5E38;&amp;#x591A;&amp;#x7684;&amp;#x4F18;&amp;#x5316;&amp;#xFF0C;&amp;#x81A8;&amp;#x80C0;&amp;#x5F0F;&amp;#x76">
<meta name="twitter:image" content="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/浅谈偏向锁、轻量级锁、重量级锁/锁分配和膨胀过程.png">
  
    <link rel="alternative" href="/atom.xml" title="程序猿说你好" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" href="/main.css">
  
<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-89666809-1', 'auto');
ga('send', 'pageview');

</script>
<!-- End Google Analytics -->


</head>

<body>
  <div id="container">
    <div class="left-col">
      <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/avatar.jpg" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">猴子007</a></h1>
		</hgroup>

		
		<p class="header-subtitle">来了就是猿</p>
		

		<nav class="header-menu">
			<ul>
			
				<li><a href="/">主页</a></li>
	        
				<li><a href="/archives/">时间线</a></li>
	        
			</ul>
		</nav>
		<nav class="header-smart-menu">
	        
    		
    			
    			<a class="js-smart-menu" data-idx="0" href="javascript:void(0)">所有文章</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="1" href="javascript:void(0)">标签</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="2" href="javascript:void(0)">友链</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="3" href="javascript:void(0)">关于我</a>
    			
    			
            
		</nav>
		<nav class="header-nav">
			<div class="social">
				
					<a class="github" target="_blank" href="https://github.com/monkeysayhi" title="github"><i class="icon-github"></i></a>
		        
					<a class="rss" target="_blank" href="/atom.xml" title="rss"><i class="icon-rss"></i></a>
		        
					<a class="mail" target="_blank" href="mailto:monkeysayhi@163.com" title="mail"><i class="icon-mail"></i></a>
		        
			</div>
		</nav>
	</header>		
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"><i class="icon-sort"></i></div>
  		<h1 class="header-author js-mobile-header hide">猴子007</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				
					<img src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/avatar.jpg" class="js-avatar">
				
			</div>
			<hgroup>
			  <h1 class="header-author">猴子007</h1>
			</hgroup>
			
			<p class="header-subtitle">来了就是猿</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives/">时间线</a></li>
		        
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/monkeysayhi" title="github"><i class="icon-github"></i></a>
			        
						<a class="rss" target="_blank" href="/atom.xml" title="rss"><i class="icon-rss"></i></a>
			        
						<a class="mail" target="_blank" href="mailto:monkeysayhi@163.com" title="mail"><i class="icon-mail"></i></a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap">
        <article id="post-浅谈偏向锁、轻量级锁、重量级锁" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      浅谈偏向锁、轻量级锁、重量级锁
    </h1>
  

        <a href="/2018/01/02/浅谈偏向锁、轻量级锁、重量级锁/" class="archive-article-date">
  	<time datetime="2018-01-02T05:34:25.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2018-01-02</time>
</a>

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x4E3A;&#x4E86;&#x6362;&#x53D6;&#x6027;&#x80FD;&#xFF0C;JVM&#x5728;&#x5185;&#x7F6E;&#x9501;&#x4E0A;&#x505A;&#x4E86;&#x975E;&#x5E38;&#x591A;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x81A8;&#x80C0;&#x5F0F;&#x7684;&#x9501;&#x5206;&#x914D;&#x7B56;&#x7565;&#x5C31;&#x662F;&#x5176;&#x4E00;&#x3002;&#x7406;&#x89E3;&#x504F;&#x5411;&#x9501;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x3001;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x7684;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#xFF0C;&#x51E0;&#x79CD;&#x9501;&#x7684;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x7F16;&#x5199;&#x5E76;&#x4F18;&#x5316;&#x57FA;&#x4E8E;&#x9501;&#x7684;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x3002;</p>
<a id="more"></a>
<blockquote>
<p>&#x5185;&#x7F6E;&#x9501;&#x7684;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#xFF0C;&#x9650;&#x4E8E;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#xFF0C;&#x6587;&#x4E2D;&#x8BE5;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x662F;&#x6839;&#x636E;&#x7F51;&#x4E0A;&#x7684;&#x591A;&#x65B9;&#x8D44;&#x6599;&#x6574;&#x5408;&#x800C;&#x6765;&#xFF1B;&#x4EC5;&#x4E3A;&#x65B9;&#x4FBF;&#x67E5;&#x9605;&#xFF0C;&#x540E;&#x9762;&#x7EE7;&#x7EED;&#x5206;&#x6790;JVM&#x6E90;&#x7801;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x6709;&#x4E2A;&#x53C2;&#x8003;&#x3002;&#x5982;&#x679C;&#x5BF9;&#x5404;&#x7EA7;&#x9501;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x57FA;&#x672C;&#x4E86;&#x89E3;&#xFF0C;&#x8BFB;&#x8005;&#x5927;&#x53EF;&#x8DF3;&#x8FC7;&#x6B64;&#x6587;&#x3002;</p>
</blockquote>
<h1 id="&#x9690;&#x85CF;&#x5728;&#x5185;&#x7F6E;&#x9501;&#x4E0B;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;"><a href="#&#x9690;&#x85CF;&#x5728;&#x5185;&#x7F6E;&#x9501;&#x4E0B;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;" class="headerlink" title="&#x9690;&#x85CF;&#x5728;&#x5185;&#x7F6E;&#x9501;&#x4E0B;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;"></a>&#x9690;&#x85CF;&#x5728;&#x5185;&#x7F6E;&#x9501;&#x4E0B;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;</h1><p>&#x5185;&#x7F6E;&#x9501;&#x662F;JVM&#x63D0;&#x4F9B;&#x7684;&#x6700;&#x4FBF;&#x6377;&#x7684;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x5DE5;&#x5177;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x5757;&#x6216;&#x65B9;&#x6CD5;&#x58F0;&#x660E;&#x4E0A;&#x6DFB;&#x52A0;synchronized&#x5173;&#x952E;&#x5B57;&#x5373;&#x53EF;&#x4F7F;&#x7528;&#x5185;&#x7F6E;&#x9501;&#x3002;&#x4F7F;&#x7528;&#x5185;&#x7F6E;&#x9501;&#x80FD;&#x591F;&#x7B80;&#x5316;&#x5E76;&#x53D1;&#x6A21;&#x578B;&#xFF1B;&#x968F;&#x7740;JVM&#x7684;&#x5347;&#x7EA7;&#xFF0C;&#x51E0;&#x4E4E;&#x4E0D;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4EAB;&#x53D7;JVM&#x5728;&#x5185;&#x7F6E;&#x9501;&#x4E0A;&#x7684;&#x4F18;&#x5316;&#x6210;&#x679C;&#x3002;&#x4ECE;&#x7B80;&#x5355;&#x7684;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#xFF0C;&#x5230;&#x9010;&#x6E10;&#x81A8;&#x80C0;&#x7684;&#x9501;&#x5206;&#x914D;&#x7B56;&#x7565;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x591A;&#x79CD;&#x4F18;&#x5316;&#x624B;&#x6BB5;&#x89E3;&#x51B3;&#x9690;&#x85CF;&#x5728;&#x5185;&#x7F6E;&#x9501;&#x4E0B;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x91CD;&#x91CF;&#x7EA7;&#x9501;"><a href="#&#x91CD;&#x91CF;&#x7EA7;&#x9501;" class="headerlink" title="&#x91CD;&#x91CF;&#x7EA7;&#x9501;"></a>&#x91CD;&#x91CF;&#x7EA7;&#x9501;</h2><p>&#x5185;&#x7F6E;&#x9501;&#x5728;Java&#x4E2D;&#x88AB;&#x62BD;&#x8C61;&#x4E3A;&#x76D1;&#x89C6;&#x5668;&#x9501;&#xFF08;monitor&#xFF09;&#x3002;&#x5728;JDK 1.6&#x4E4B;&#x524D;&#xFF0C;&#x76D1;&#x89C6;&#x5668;&#x9501;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x76F4;&#x63A5;&#x5BF9;&#x5E94;&#x5E95;&#x5C42;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E92;&#x65A5;&#x91CF;&#xFF08;mutex&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x540C;&#x6B65;&#x65B9;&#x5F0F;&#x7684;&#x6210;&#x672C;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x5305;&#x62EC;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5F15;&#x8D77;&#x7684;&#x5185;&#x6838;&#x6001;&#x4E0E;&#x7528;&#x6237;&#x6001;&#x5207;&#x6362;&#x3001;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x9020;&#x6210;&#x7684;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x7B49;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x540E;&#x6765;&#x79F0;&#x8FD9;&#x79CD;&#x9501;&#x4E3A;&#x201C;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x201D;&#x3002;</p>
<h3 id="&#x81EA;&#x65CB;&#x9501;"><a href="#&#x81EA;&#x65CB;&#x9501;" class="headerlink" title="&#x81EA;&#x65CB;&#x9501;"></a>&#x81EA;&#x65CB;&#x9501;</h3><p>&#x9996;&#x5148;&#xFF0C;&#x5185;&#x6838;&#x6001;&#x4E0E;&#x7528;&#x6237;&#x6001;&#x7684;&#x5207;&#x6362;&#x4E0A;&#x4E0D;&#x5BB9;&#x6613;&#x4F18;&#x5316;&#x3002;&#x4F46;<strong>&#x901A;&#x8FC7;&#x81EA;&#x65CB;&#x9501;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x9020;&#x6210;&#x7684;&#x7EBF;&#x7A0B;&#x5207;&#x6362;</strong>&#xFF08;&#x5305;&#x62EC;&#x6302;&#x8D77;&#x7EBF;&#x7A0B;&#x548C;&#x6062;&#x590D;&#x7EBF;&#x7A0B;&#xFF09;&#x3002;</p>
<p>&#x5982;&#x679C;&#x9501;&#x7684;&#x7C92;&#x5EA6;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;<strong>&#x9501;&#x7684;&#x6301;&#x6709;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x77ED;</strong>&#xFF08;&#x5C3D;&#x7BA1;&#x5177;&#x4F53;&#x7684;&#x6301;&#x6709;&#x65F6;&#x95F4;&#x65E0;&#x6CD5;&#x5F97;&#x77E5;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#xFF0C;&#x901A;&#x5E38;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x9501;&#x80FD;&#x6EE1;&#x8DB3;&#x4E0A;&#x8FF0;&#x6027;&#x8D28;&#xFF09;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5BF9;&#x4E8E;&#x7ADE;&#x4E89;&#x8FD9;&#x4E9B;&#x9501;&#x7684;&#x800C;&#x8A00;&#xFF0C;&#x56E0;&#x4E3A;&#x9501;&#x963B;&#x585E;&#x9020;&#x6210;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x9501;&#x6301;&#x6709;&#x7684;&#x65F6;&#x95F4;&#x76F8;&#x5F53;&#xFF0C;&#x51CF;&#x5C11;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x9020;&#x6210;&#x7684;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#xFF0C;&#x80FD;&#x5F97;&#x5230;&#x8F83;&#x5927;&#x7684;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x3002;&#x5177;&#x4F53;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7ADE;&#x4E89;&#x9501;&#x5931;&#x8D25;&#x65F6;&#xFF0C;&#x6253;&#x7B97;&#x963B;&#x585E;&#x81EA;&#x5DF1;</li>
<li>&#x4E0D;&#x76F4;&#x63A5;&#x963B;&#x585E;&#x81EA;&#x5DF1;&#xFF0C;&#x800C;&#x662F;&#x81EA;&#x65CB;&#xFF08;&#x7A7A;&#x7B49;&#x5F85;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;&#x6709;&#x9650;for&#x5FAA;&#x73AF;&#xFF09;&#x4E00;&#x4F1A;</li>
<li>&#x5728;&#x81EA;&#x65CB;&#x7684;&#x540C;&#x65F6;&#x91CD;&#x65B0;&#x7ADE;&#x4E89;&#x9501;</li>
<li>&#x5982;&#x679C;&#x81EA;&#x65CB;&#x7ED3;&#x675F;&#x524D;&#x83B7;&#x5F97;&#x4E86;&#x9501;&#xFF0C;&#x90A3;&#x4E48;&#x9501;&#x83B7;&#x53D6;&#x6210;&#x529F;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x81EA;&#x65CB;&#x7ED3;&#x675F;&#x540E;&#x963B;&#x585E;&#x81EA;&#x5DF1;</li>
</ul>
<p><em>&#x5982;&#x679C;&#x5728;&#x81EA;&#x65CB;&#x7684;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x9501;&#x5C31;&#x88AB;&#x65E7;owner&#x91CA;&#x653E;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x963B;&#x585E;&#x81EA;&#x5DF1;</em>&#xFF08;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x672A;&#x6765;&#x9501;&#x91CA;&#x653E;&#x65F6;&#x6062;&#x590D;&#xFF09;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x4E00;&#x6B21;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x3002;</p>
<p>&#x201C;&#x9501;&#x7684;&#x6301;&#x6709;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x77ED;&#x201D;&#x8FD9;&#x4E00;&#x6761;&#x4EF6;&#x53EF;&#x4EE5;&#x653E;&#x5BBD;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x53EA;&#x8981;&#x9501;&#x7ADE;&#x4E89;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x77ED;&#xFF08;&#x6BD4;&#x5982;&#x7EBF;&#x7A0B;1&#x5FEB;&#x91CA;&#x653E;&#x9501;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7EBF;&#x7A0B;2&#x624D;&#x4F1A;&#x6765;&#x7ADE;&#x4E89;&#x9501;&#xFF09;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x81EA;&#x65CB;&#x83B7;&#x5F97;&#x9501;&#x7684;&#x6982;&#x7387;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x53D1;&#x751F;&#x5728;<strong>&#x9501;&#x6301;&#x6709;&#x65F6;&#x95F4;&#x957F;&#xFF0C;&#x4F46;&#x7ADE;&#x4E89;&#x4E0D;&#x6FC0;&#x70C8;</strong>&#x7684;&#x573A;&#x666F;&#x4E2D;&#x3002;</p>
<h4 id="&#x7F3A;&#x70B9;"><a href="#&#x7F3A;&#x70B9;" class="headerlink" title="&#x7F3A;&#x70B9;"></a>&#x7F3A;&#x70B9;</h4><ul>
<li>&#x5355;&#x6838;&#x5904;&#x7406;&#x5668;&#x4E0A;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x5E76;&#x884C;&#xFF0C;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x4E0D;&#x963B;&#x585E;&#x81EA;&#x5DF1;&#x7684;&#x8BDD;&#xFF0C;&#x65E7;owner&#x5C31;&#x4E0D;&#x80FD;&#x6267;&#x884C;&#xFF0C;&#x9501;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x91CA;&#x653E;&#xFF0C;&#x6B64;&#x65F6;&#x4E0D;&#x7BA1;&#x81EA;&#x65CB;&#x591A;&#x4E45;&#x90FD;&#x662F;&#x6D6A;&#x8D39;&#xFF1B;&#x8FDB;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x7EBF;&#x7A0B;&#x591A;&#x800C;&#x5904;&#x7406;&#x5668;&#x5C11;&#xFF0C;&#x81EA;&#x65CB;&#x4E5F;&#x4F1A;&#x9020;&#x6210;&#x4E0D;&#x5C11;&#x65E0;&#x8C13;&#x7684;&#x6D6A;&#x8D39;&#x3002;</li>
<li>&#x81EA;&#x65CB;&#x9501;&#x8981;&#x5360;&#x7528;CPU&#xFF0C;&#x5982;&#x679C;&#x662F;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD9;&#x4E00;&#x4F18;&#x5316;&#x901A;&#x5E38;&#x5F97;&#x4E0D;&#x507F;&#x5931;&#xFF0C;&#x51CF;&#x5C11;&#x9501;&#x7684;&#x4F7F;&#x7528;&#x662F;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</li>
<li>&#x5982;&#x679C;&#x9501;&#x7ADE;&#x4E89;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x957F;&#xFF0C;&#x90A3;&#x4E48;&#x81EA;&#x65CB;&#x901A;&#x5E38;&#x4E0D;&#x80FD;&#x83B7;&#x5F97;&#x9501;&#xFF0C;&#x767D;&#x767D;&#x6D6A;&#x8D39;&#x4E86;&#x81EA;&#x65CB;&#x5360;&#x7528;&#x7684;CPU&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x53D1;&#x751F;&#x5728;<em>&#x9501;&#x6301;&#x6709;&#x65F6;&#x95F4;&#x957F;&#xFF0C;&#x4E14;&#x7ADE;&#x4E89;&#x6FC0;&#x70C8;</em>&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6B64;&#x65F6;&#x5E94;&#x4E3B;&#x52A8;&#x7981;&#x7528;&#x81EA;&#x65CB;&#x9501;&#x3002;</li>
</ul>
<blockquote>
<p>&#x4F7F;&#x7528;-XX:-UseSpinning&#x53C2;&#x6570;&#x5173;&#x95ED;&#x81EA;&#x65CB;&#x9501;&#x4F18;&#x5316;&#xFF1B;-XX:PreBlockSpin&#x53C2;&#x6570;&#x4FEE;&#x6539;&#x9ED8;&#x8BA4;&#x7684;&#x81EA;&#x65CB;&#x6B21;&#x6570;&#x3002;</p>
</blockquote>
<h3 id="&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;&#x9501;"><a href="#&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;&#x9501;" class="headerlink" title="&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;&#x9501;"></a>&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;&#x9501;</h3><p>&#x81EA;&#x9002;&#x5E94;&#x610F;&#x5473;&#x7740;&#x81EA;&#x65CB;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x518D;&#x56FA;&#x5B9A;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x524D;&#x4E00;&#x6B21;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x4E0A;&#x7684;&#x81EA;&#x65CB;&#x65F6;&#x95F4;&#x53CA;&#x9501;&#x7684;&#x62E5;&#x6709;&#x8005;&#x7684;&#x72B6;&#x6001;&#x6765;&#x51B3;&#x5B9A;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x5BF9;&#x8C61;&#x4E0A;&#xFF0C;&#x81EA;&#x65CB;&#x7B49;&#x5F85;&#x521A;&#x521A;&#x6210;&#x529F;&#x83B7;&#x5F97;&#x8FC7;&#x9501;&#xFF0C;&#x5E76;&#x4E14;&#x6301;&#x6709;&#x9501;&#x7684;&#x7EBF;&#x7A0B;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x865A;&#x62DF;&#x673A;&#x5C31;&#x4F1A;&#x8BA4;&#x4E3A;&#x8FD9;&#x6B21;&#x81EA;&#x65CB;&#x4E5F;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x518D;&#x6B21;&#x6210;&#x529F;&#xFF0C;&#x8FDB;&#x800C;&#x5B83;&#x5C06;&#x5141;&#x8BB8;&#x81EA;&#x65CB;&#x7B49;&#x5F85;&#x6301;&#x7EED;&#x76F8;&#x5BF9;&#x66F4;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6BD4;&#x5982;100&#x4E2A;&#x5FAA;&#x73AF;&#x3002;</li>
<li>&#x76F8;&#x53CD;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x9501;&#xFF0C;&#x81EA;&#x65CB;&#x5F88;&#x5C11;&#x6210;&#x529F;&#x83B7;&#x5F97;&#x8FC7;&#xFF0C;&#x90A3;&#x5728;&#x4EE5;&#x540E;&#x8981;&#x83B7;&#x53D6;&#x8FD9;&#x4E2A;&#x9501;&#x65F6;&#x5C06;&#x53EF;&#x80FD;&#x51CF;&#x5C11;&#x81EA;&#x65CB;&#x65F6;&#x95F4;&#x751A;&#x81F3;&#x7701;&#x7565;&#x81EA;&#x65CB;&#x8FC7;&#x7A0B;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x6D6A;&#x8D39;&#x5904;&#x7406;&#x5668;&#x8D44;&#x6E90;&#x3002;</li>
</ul>
<p><strong>&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;&#x89E3;&#x51B3;&#x7684;&#x662F;&#x201C;&#x9501;&#x7ADE;&#x4E89;&#x65F6;&#x95F4;&#x4E0D;&#x786E;&#x5B9A;&#x201D;&#x7684;&#x95EE;&#x9898;</strong>&#x3002;JVM&#x5F88;&#x96BE;&#x611F;&#x77E5;&#x5230;&#x786E;&#x5207;&#x7684;&#x9501;&#x7ADE;&#x4E89;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4EA4;&#x7ED9;&#x7528;&#x6237;&#x5206;&#x6790;&#x5C31;&#x8FDD;&#x53CD;&#x4E86;JVM&#x7684;&#x8BBE;&#x8BA1;&#x521D;&#x8877;&#x3002;<em>&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;&#x5047;&#x5B9A;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x6301;&#x6709;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x95F4;&#x57FA;&#x672C;&#x76F8;&#x5F53;&#xFF0C;&#x7ADE;&#x4E89;&#x7A0B;&#x5EA6;&#x8D8B;&#x4E8E;&#x7A33;&#x5B9A;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4E0A;&#x4E00;&#x6B21;&#x81EA;&#x65CB;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x7ED3;&#x679C;&#x8C03;&#x6574;&#x4E0B;&#x4E00;&#x6B21;&#x81EA;&#x65CB;&#x7684;&#x65F6;&#x95F4;</em>&#x3002;</p>
<h4 id="&#x7F3A;&#x70B9;-1"><a href="#&#x7F3A;&#x70B9;-1" class="headerlink" title="&#x7F3A;&#x70B9;"></a>&#x7F3A;&#x70B9;</h4><p>&#x7136;&#x800C;&#xFF0C;&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;&#x4E5F;&#x6CA1;&#x80FD;&#x5F7B;&#x5E95;&#x89E3;&#x51B3;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;<em>&#x5982;&#x679C;&#x9ED8;&#x8BA4;&#x7684;&#x81EA;&#x65CB;&#x6B21;&#x6570;&#x8BBE;&#x7F6E;&#x4E0D;&#x5408;&#x7406;&#xFF08;&#x8FC7;&#x9AD8;&#x6216;&#x8FC7;&#x4F4E;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x8FC7;&#x7A0B;&#x5C06;&#x5F88;&#x96BE;&#x6536;&#x655B;&#x5230;&#x5408;&#x9002;&#x7684;&#x503C;</em>&#x3002;</p>
<h2 id="&#x8F7B;&#x91CF;&#x7EA7;&#x9501;"><a href="#&#x8F7B;&#x91CF;&#x7EA7;&#x9501;" class="headerlink" title="&#x8F7B;&#x91CF;&#x7EA7;&#x9501;"></a>&#x8F7B;&#x91CF;&#x7EA7;&#x9501;</h2><p>&#x81EA;&#x65CB;&#x9501;&#x7684;&#x76EE;&#x6807;&#x662F;&#x964D;&#x4F4E;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x7684;&#x6210;&#x672C;&#x3002;&#x5982;&#x679C;&#x9501;&#x7ADE;&#x4E89;&#x6FC0;&#x70C8;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#xFF0C;&#x8BA9;&#x7ADE;&#x4E89;&#x5931;&#x8D25;&#x7684;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#xFF1B;&#x5982;&#x679C;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x7684;&#x9501;&#x7ADE;&#x4E89;&#xFF0C;&#x90A3;&#x4E48;&#x7533;&#x8BF7;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x90FD;&#x662F;&#x6D6A;&#x8D39;&#x7684;&#x3002;<strong>&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x7684;&#x76EE;&#x6807;&#x662F;&#xFF0C;&#x51CF;&#x5C11;&#x65E0;&#x5B9E;&#x9645;&#x7ADE;&#x4E89;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x4EA7;&#x751F;&#x7684;&#x6027;&#x80FD;&#x6D88;&#x8017;</strong>&#xFF0C;&#x5305;&#x62EC;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5F15;&#x8D77;&#x7684;&#x5185;&#x6838;&#x6001;&#x4E0E;&#x7528;&#x6237;&#x6001;&#x5207;&#x6362;&#x3001;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x9020;&#x6210;&#x7684;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x7B49;&#x3002;</p>
<p>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x800C;&#x8A00;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x65F6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7533;&#x8BF7;&#x4E92;&#x65A5;&#x91CF;&#xFF0C;&#x4EC5;&#x4EC5;<em>&#x5C06;Mark Word&#x4E2D;&#x7684;&#x90E8;&#x5206;&#x5B57;&#x8282;CAS&#x66F4;&#x65B0;&#x6307;&#x5411;&#x7EBF;&#x7A0B;&#x6808;&#x4E2D;&#x7684;Lock Record&#xFF0C;&#x5982;&#x679C;&#x66F4;&#x65B0;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x83B7;&#x53D6;&#x6210;&#x529F;</em>&#xFF0C;&#x8BB0;&#x5F55;&#x9501;&#x72B6;&#x6001;&#x4E3A;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#xFF1B;<em>&#x5426;&#x5219;&#xFF0C;&#x8BF4;&#x660E;&#x5DF2;&#x7ECF;&#x6709;&#x7EBF;&#x7A0B;&#x83B7;&#x5F97;&#x4E86;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#xFF0C;&#x76EE;&#x524D;&#x53D1;&#x751F;&#x4E86;&#x9501;&#x7ADE;&#x4E89;&#xFF08;&#x4E0D;&#x9002;&#x5408;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#xFF09;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x81A8;&#x80C0;&#x4E3A;&#x91CD;&#x91CF;&#x7EA7;&#x9501;</em>&#x3002;</p>
<blockquote>
<p>Mark Word&#x662F;&#x5BF9;&#x8C61;&#x5934;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1B;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7EBF;&#x7A0B;&#x6808;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x6808;&#xFF09;&#xFF0C;&#x8BB0;&#x5F55;&#x7EBF;&#x7A0B;&#x548C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x3002;&#x4E8C;&#x8005;&#x5C5E;&#x4E8E;JVM&#x7684;&#x57FA;&#x7840;&#x5185;&#x5BB9;&#xFF0C;&#x6B64;&#x5904;&#x4E0D;&#x505A;&#x4ECB;&#x7ECD;&#x3002;</p>
</blockquote>
<p>&#x5F53;&#x7136;&#xFF0C;&#x7531;&#x4E8E;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x5929;&#x7136;&#x7784;&#x51C6;&#x4E0D;&#x5B58;&#x5728;&#x9501;&#x7ADE;&#x4E89;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#x9501;&#x7ADE;&#x4E89;&#x4F46;&#x4E0D;&#x6FC0;&#x70C8;&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x7528;&#x81EA;&#x65CB;&#x9501;&#x4F18;&#x5316;&#xFF0C;<em>&#x81EA;&#x65CB;&#x5931;&#x8D25;&#x540E;&#x518D;&#x81A8;&#x80C0;&#x4E3A;&#x91CD;&#x91CF;&#x7EA7;&#x9501;</em>&#x3002;</p>
<h3 id="&#x7F3A;&#x70B9;-2"><a href="#&#x7F3A;&#x70B9;-2" class="headerlink" title="&#x7F3A;&#x70B9;"></a>&#x7F3A;&#x70B9;</h3><p>&#x540C;&#x81EA;&#x65CB;&#x9501;&#x76F8;&#x4F3C;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;<em>&#x9501;&#x7ADE;&#x4E89;&#x6FC0;&#x70C8;</em>&#xFF0C;&#x90A3;&#x4E48;&#x8F7B;&#x91CF;&#x7EA7;&#x5C06;&#x5F88;&#x5FEB;&#x81A8;&#x80C0;&#x4E3A;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#xFF0C;&#x90A3;&#x4E48;&#x7EF4;&#x6301;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x6210;&#x4E86;&#x6D6A;&#x8D39;&#x3002;</li>
</ul>
<h2 id="&#x504F;&#x5411;&#x9501;"><a href="#&#x504F;&#x5411;&#x9501;" class="headerlink" title="&#x504F;&#x5411;&#x9501;"></a>&#x504F;&#x5411;&#x9501;</h2><p>&#x5728;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x7ADE;&#x4E89;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD8;&#x80FD;&#x591F;&#x9488;&#x5BF9;&#x90E8;&#x5206;&#x573A;&#x666F;&#x7EE7;&#x7EED;&#x4F18;&#x5316;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x4EC5;&#x4EC5;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x7ADE;&#x4E89;&#xFF0C;&#x81EA;&#x59CB;&#x81F3;&#x7EC8;&#xFF0C;&#x4F7F;&#x7528;&#x9501;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x7EF4;&#x62A4;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x90FD;&#x662F;&#x6D6A;&#x8D39;&#x7684;&#x3002;<strong>&#x504F;&#x5411;&#x9501;&#x7684;&#x76EE;&#x6807;&#x662F;&#xFF0C;&#x51CF;&#x5C11;&#x65E0;&#x7ADE;&#x4E89;&#x4E14;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4F7F;&#x7528;&#x9501;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x4EA7;&#x751F;&#x7684;&#x6027;&#x80FD;&#x6D88;&#x8017;</strong>&#x3002;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x6BCF;&#x6B21;&#x7533;&#x8BF7;&#x3001;&#x91CA;&#x653E;&#x9501;&#x90FD;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x4E00;&#x6B21;CAS&#xFF0C;&#x4F46;&#x504F;&#x5411;&#x9501;&#x53EA;&#x6709;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x9700;&#x8981;&#x4E00;&#x6B21;CAS&#x3002;</p>
<p>&#x201C;&#x504F;&#x5411;&#x201D;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;<em>&#x504F;&#x5411;&#x9501;&#x5047;&#x5B9A;&#x5C06;&#x6765;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x7533;&#x8BF7;&#x9501;&#x7684;&#x7EBF;&#x7A0B;&#x4F1A;&#x4F7F;&#x7528;&#x9501;</em>&#xFF08;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x7EBF;&#x7A0B;&#x518D;&#x6765;&#x7533;&#x8BF7;&#x9501;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;<em>&#x53EA;&#x9700;&#x8981;&#x5728;Mark Word&#x4E2D;CAS&#x8BB0;&#x5F55;owner&#xFF08;&#x672C;&#x8D28;&#x4E0A;&#x4E5F;&#x662F;&#x66F4;&#x65B0;&#xFF0C;&#x4F46;&#x521D;&#x59CB;&#x503C;&#x4E3A;&#x7A7A;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x8BB0;&#x5F55;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x504F;&#x5411;&#x9501;&#x83B7;&#x53D6;&#x6210;&#x529F;</em>&#xFF0C;&#x8BB0;&#x5F55;&#x9501;&#x72B6;&#x6001;&#x4E3A;&#x504F;&#x5411;&#x9501;&#xFF0C;<em>&#x4EE5;&#x540E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7B49;&#x4E8E;owner&#x5C31;&#x53EF;&#x4EE5;&#x96F6;&#x6210;&#x672C;&#x7684;&#x76F4;&#x63A5;&#x83B7;&#x5F97;&#x9501;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x8BF4;&#x660E;&#x6709;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7ADE;&#x4E89;&#xFF0C;&#x81A8;&#x80C0;&#x4E3A;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;</em>&#x3002;</p>
<p>&#x504F;&#x5411;&#x9501;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x81EA;&#x65CB;&#x9501;&#x4F18;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x6709;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7533;&#x8BF7;&#x9501;&#xFF0C;&#x5C31;&#x7834;&#x574F;&#x4E86;&#x504F;&#x5411;&#x9501;&#x7684;&#x5047;&#x5B9A;&#x3002;</p>
<h3 id="&#x7F3A;&#x70B9;-3"><a href="#&#x7F3A;&#x70B9;-3" class="headerlink" title="&#x7F3A;&#x70B9;"></a>&#x7F3A;&#x70B9;</h3><p>&#x540C;&#x6837;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x660E;&#x663E;&#x5B58;&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7533;&#x8BF7;&#x9501;&#xFF0C;&#x90A3;&#x4E48;&#x504F;&#x5411;&#x9501;&#x5C06;&#x5F88;&#x5FEB;&#x81A8;&#x80C0;&#x4E3A;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x3002;</p>
<blockquote>
<p>&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x526F;&#x4F5C;&#x7528;&#x5DF2;&#x7ECF;&#x5C0F;&#x7684;&#x591A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x9700;&#x8981;&#xFF0C;&#x4F7F;&#x7528;&#x53C2;&#x6570;-XX:-UseBiasedLocking&#x7981;&#x6B62;&#x504F;&#x5411;&#x9501;&#x4F18;&#x5316;&#xFF08;&#x9ED8;&#x8BA4;&#x6253;&#x5F00;&#xFF09;&#x3002;</p>
</blockquote>
<h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><blockquote>
<p>&#x504F;&#x5411;&#x9501;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x3001;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x7684;&#x8BE6;&#x7EC6;&#x8FC7;&#x7A0B;&#x89C1;&#x540E;&#x3002;&#x4F1A;&#x6D89;&#x53CA;&#x4E00;&#x4E9B;Mark Word&#x4E0E;CAS&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
</blockquote>
<p>&#x504F;&#x5411;&#x9501;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x3001;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x9002;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5E76;&#x53D1;&#x573A;&#x666F;&#xFF1A;</p>
<ul>
<li>&#x504F;&#x5411;&#x9501;&#xFF1A;&#x65E0;&#x5B9E;&#x9645;&#x7ADE;&#x4E89;&#xFF0C;&#x4E14;&#x5C06;&#x6765;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x7533;&#x8BF7;&#x9501;&#x7684;&#x7EBF;&#x7A0B;&#x4F1A;&#x4F7F;&#x7528;&#x9501;&#x3002;</li>
<li>&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#xFF1A;&#x65E0;&#x5B9E;&#x9645;&#x7ADE;&#x4E89;&#xFF0C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4EA4;&#x66FF;&#x4F7F;&#x7528;&#x9501;&#xFF1B;&#x5141;&#x8BB8;&#x77ED;&#x65F6;&#x95F4;&#x7684;&#x9501;&#x7ADE;&#x4E89;&#x3002;</li>
<li>&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#xFF1A;&#x6709;&#x5B9E;&#x9645;&#x7ADE;&#x4E89;&#xFF0C;&#x4E14;&#x9501;&#x7ADE;&#x4E89;&#x65F6;&#x95F4;&#x957F;&#x3002;</li>
</ul>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x9501;&#x7ADE;&#x4E89;&#x65F6;&#x95F4;&#x77ED;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x81EA;&#x65CB;&#x9501;&#x8FDB;&#x4E00;&#x6B65;&#x4F18;&#x5316;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x3001;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x51CF;&#x5C11;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x3002;</p>
<p>&#x5982;&#x679C;&#x9501;&#x7ADE;&#x4E89;&#x7A0B;&#x5EA6;&#x9010;&#x6E10;&#x63D0;&#x9AD8;&#xFF08;&#x7F13;&#x6162;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x4ECE;&#x504F;&#x5411;&#x9501;&#x9010;&#x6B65;&#x81A8;&#x80C0;&#x5230;&#x91CD;&#x91CF;&#x9501;&#xFF0C;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x3002;</p>
<h1 id="&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;"><a href="#&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;" class="headerlink" title="&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;"></a>&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;</h1><blockquote>
<p>&#x91CD;&#x7533;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4E3B;&#x8981;&#x662F;&#x6839;&#x636E;&#x7F51;&#x4E0A;&#x7684;&#x591A;&#x65B9;&#x8D44;&#x6599;&#x6574;&#x7406;&#x3002;&#x6838;&#x5FC3;&#x662F;&#x8FD9;&#x4F4D;<a href="https://blog.dreamtobe.cn/" target="_blank" rel="external">&#x5DE8;&#x5DE8;</a>&#x6574;&#x7406;&#x7684;&#x6D41;&#x7A0B;&#x56FE;&#xFF0C;&#x76F8;&#x5F53;&#x8BE6;&#x7EC6;&#xFF0C;&#x57FA;&#x672C;&#x7B26;&#x5408;&#x903B;&#x8F91;&#x3002;</p>
</blockquote>
<p>&#x524D;&#x9762;&#x8BB2;&#x8FF0;&#x4E86;&#x5185;&#x7F6E;&#x9501;&#x5728;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x4E00;&#x7B14;&#x5E26;&#x8FC7;&#x3002;&#x8BE6;&#x7EC6;&#x7684;&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/&#x6D45;&#x8C08;&#x504F;&#x5411;&#x9501;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x3001;&#x91CD;&#x91CF;&#x7EA7;&#x9501;/&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;.png" alt="&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;"></p>
<blockquote>
<p>&#x56FE;&#x4E2D;&#x6709;&#x4E00;&#x5904;&#x7591;&#x95EE;&#xFF1A;</p>
<p>&#x6309;&#x7167;&#x56FE;&#x4E2D;&#x6D41;&#x7A0B;&#xFF0C;<em>&#x5982;&#x679C;&#x53D1;&#x73B0;&#x9501;&#x5DF2;&#x7ECF;&#x81A8;&#x80C0;&#x4E3A;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x4E92;&#x65A5;&#x91CF;mutex&#x963B;&#x585E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;</em>&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x81EA;&#x65CB;&#x9501;&#x7684;&#x4E00;&#x5927;&#x597D;&#x5904;&#x5C31;&#x662F;&#x51CF;&#x5C11;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x7684;&#x5F00;&#x9500;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x76F4;&#x63A5;&#x963B;&#x585E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF0C;&#x5927;&#x53EF;&#x4EE5;&#x50CF;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x4E00;&#x6837;&#xFF0C;&#x81EA;&#x65CB;&#x4E00;&#x4F1A;&#xFF0C;&#x5931;&#x8D25;&#x4E86;&#x518D;&#x963B;&#x585E;&#x3002;</p>
</blockquote>
<p>&#x7279;&#x522B;&#x8BF4;&#x660E;&#x4E24;&#x70B9;&#xFF1A;</p>
<ul>
<li>CAS&#x8BB0;&#x5F55;owner&#x65F6;&#xFF0C;<em><code>expected == null</code></em>&#xFF0C;<code>newValue == ownerThreadId</code>&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;<strong>&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x7533;&#x8BF7;&#x504F;&#x5411;&#x9501;&#x7684;&#x7EBF;&#x7A0B;&#x80FD;&#x591F;&#x8FD4;&#x56DE;&#x6210;&#x529F;&#xFF0C;&#x540E;&#x7EED;&#x7EBF;&#x7A0B;&#x90FD;&#x5FC5;&#x7136;&#x5931;&#x8D25;</strong>&#xFF08;&#x90E8;&#x5206;&#x7EBF;&#x7A0B;&#x68C0;&#x6D4B;&#x5230;&#x53EF;&#x504F;&#x5411;&#xFF0C;&#x540C;&#x65F6;&#x5C1D;&#x8BD5;CAS&#x8BB0;&#x5F55;owner&#xFF09;&#x3002;</li>
<li><strong>&#x5185;&#x7F6E;&#x9501;&#x53EA;&#x80FD;&#x6CBF;&#x7740;&#x504F;&#x5411;&#x9501;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x3001;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x7684;&#x987A;&#x5E8F;&#x9010;&#x6E10;&#x81A8;&#x80C0;</strong>&#xFF0C;&#x4E0D;&#x80FD;&#x201C;&#x6536;&#x7F29;&#x201D;&#x3002;&#x8FD9;&#x57FA;&#x4E8E;JVM&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5047;&#x5B9A;&#xFF0C;&#x201C;<em>&#x4E00;&#x65E6;&#x7834;&#x574F;&#x4E86;&#x4E0A;&#x4E00;&#x7EA7;&#x9501;&#x7684;&#x5047;&#x5B9A;&#xFF0C;&#x5C31;&#x8BA4;&#x4E3A;&#x8BE5;&#x5047;&#x5B9A;&#x4EE5;&#x540E;&#x4E5F;&#x5FC5;&#x4E0D;&#x6210;&#x7ACB;</em>&#x201D;&#x3002;</li>
</ul>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5F53;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x88AB;&#x89E3;&#x9664;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x5524;&#x9192;&#x4E00;&#x4E2A;&#x88AB;&#x963B;&#x585E;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x903B;&#x8F91;&#x4E0E;ReentrantLock&#x57FA;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x8BE6;&#x89C1;<a href="https://monkeysayhi.github.io/2017/12/05/&#x6E90;&#x7801;|&#x5E76;&#x53D1;&#x4E00;&#x679D;&#x82B1;&#x4E4B;ReentrantLock&#x4E0E;AQS&#xFF08;1&#xFF09;&#xFF1A;lock&#x3001;unlock/">&#x6E90;&#x7801;|&#x5E76;&#x53D1;&#x4E00;&#x679D;&#x82B1;&#x4E4B;ReentrantLock&#x4E0E;AQS&#xFF08;1&#xFF09;&#xFF1A;lock&#x3001;unlock</a>&#x3002;</p>
<h2 id="&#x7B80;&#x5316;&#x7248;"><a href="#&#x7B80;&#x5316;&#x7248;" class="headerlink" title="&#x7B80;&#x5316;&#x7248;"></a>&#x7B80;&#x5316;&#x7248;</h2><p>&#x4E0A;&#x56FE;&#x8BB0;&#x8F7D;&#x7684;&#x5F88;&#x8BE6;&#x7EC6;&#xFF0C;&#x4E5F;&#x6709;Mark Word&#x7684;&#x56FE;&#x89E3;&#x3002;&#x770B;&#x61C2;&#x4E0A;&#x56FE;&#x540E;&#xFF0C;&#x518D;&#x6765;&#x770B;&#x300A;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#xFF1A;JVM&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x4E0E;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF08;&#x7B2C;2&#x7248;&#xFF09;&#x300B;&#x4E2D;&#x7684;&#x7B80;&#x5316;&#x7248;&#x6D41;&#x7A0B;&#x56FE;&#x5C31;&#x80FD;&#x770B;&#x61C2;&#x4E86;&#xFF1A;</p>
<p><img src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/&#x6D45;&#x8C08;&#x504F;&#x5411;&#x9501;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x3001;&#x91CD;&#x91CF;&#x7EA7;&#x9501;/&#x7B80;&#x5316;&#x7248;&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;.png" alt="&#x7B80;&#x5316;&#x7248;&#x9501;&#x5206;&#x914D;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;"></p>
<blockquote>
<p>&#x6316;&#x5751;&#xFF1A;</p>
<p>&#x7B80;&#x5316;&#x7248;&#x4E2D;&#x6307;&#x51FA;&#x4E86;<code>&#x91CD;&#x504F;&#x5411;</code>&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x5BF9;&#x4E8E;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x548C;&#x81A8;&#x80C0;&#x8FC7;&#x7A0B;&#x90FD;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF1B;&#x4F46;&#x5982;&#x679C;&#x8003;&#x8651;&#x91CD;&#x504F;&#x5411;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x80FD;&#x4E0A;&#x8FF0;&#x7279;&#x522B;&#x8BF4;&#x660E;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x4E0D;&#x6210;&#x7ACB;&#x4E86;&#x3002;&#x8981;&#x6574;&#x7406;&#x7684;&#x7B14;&#x8BB0;&#x592A;&#x591A;&#x5566;&#x65F6;&#x95F4;&#x4E0D;&#x591F;&#x554A;&#xFF0C;&#x7334;&#x5B50;&#x9009;&#x62E9;&#x6682;&#x65F6;&#x653E;&#x5F03;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#xFF0C;&#xFF0C;&#x6069;&#xFF0C;&#x6316;&#x4E2A;&#x5751;&#xFF0C;&#x4EE5;&#x540E;&#x518D;&#x8FFD;&#x6E90;&#x7801;&#x586B;&#x5751;&#x3002;</p>
<p>&#x91CD;&#x504F;&#x5411;&#x548C;epoch&#x7684;&#x4F5C;&#x7528;&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="https://www.zhihu.com/question/56582060/answer/155398235" target="_blank" rel="external">BiasedLocking&#x6A21;&#x5F0F;&#x4E0B;markOop&#x4E2D;&#x4F4D;&#x57DF;epoch&#x7684;&#x6839;&#x672C;&#x4F5C;&#x7528;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</a></li>
</ul>
</blockquote>
<hr>
<blockquote>
<p>&#x53C2;&#x8003;:</p>
<ul>
<li><a href="https://blog.dreamtobe.cn/2015/11/13/java_synchronized/" target="_blank" rel="external">Java Synchronised&#x673A;&#x5236;</a></li>
<li><a href="https://www.zhihu.com/question/57774162/answer/154298044" target="_blank" rel="external">Java&#x504F;&#x5411;&#x9501;&#x662F;&#x5982;&#x4F55;&#x64A4;&#x9500;&#x7684;&#xFF1F;</a></li>
</ul>
</blockquote>

      

      
        <div class="page-reward">
          <a href="javascript:;" class="page-reward-btn tooltip-top">
            <div class="tooltip tooltip-east">
            <span class="tooltip-item">
              赏
            </span>
            <span class="tooltip-content">
              <span class="tooltip-text">
                <span class="tooltip-inner">
                  <p class="reward-p"><i class="icon icon-quo-left"></i>make a better world for everyone<i class="icon icon-quo-right"></i></p>
                  <div class="reward-box">
                    
                    
                    <div class="reward-box-item">
                      <img class="reward-img" src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/weixin_pay_qr_code.png">
                      <span class="reward-type">微信</span>
                    </div>
                    
                  </div>
                </span>
              </span>
            </span>
          </div>
          </a>
        </div>
      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/JVM/">JVM</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Java/">Java</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/原创/">原创</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/并发/">并发</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/面试/">面试</a></li></ul>
	</div>

      

      

      
        <div class="share-btn share-icons tooltip-left">
  <div class="tooltip tooltip-east">
    <span class="tooltip-item">
      <a href="javascript:;" class="share-sns share-outer">
        <i class="icon icon-share"></i>
      </a>
    </span>
    <span class="tooltip-content">
      <div class="share-wrap">
        <div class="share-icons">
          <a class="weibo share-sns" href="javascript:;" data-type="weibo">
            <i class="icon icon-weibo"></i>
          </a>
          <a class="weixin share-sns wxFab" href="javascript:;" data-type="weixin">
            <i class="icon icon-weixin"></i>
          </a>
          <a class="qq share-sns" href="javascript:;" data-type="qq">
            <i class="icon icon-qq"></i>
          </a>
          <a class="douban share-sns" href="javascript:;" data-type="douban">
            <i class="icon icon-douban"></i>
          </a>
          <a class="qzone share-sns" href="javascript:;" data-type="qzone">
            <i class="icon icon-qzone"></i>
          </a>
          <a class="facebook share-sns" href="javascript:;" data-type="facebook">
            <i class="icon icon-facebook"></i>
          </a>
          <a class="twitter share-sns" href="javascript:;" data-type="twitter">
            <i class="icon icon-twitter"></i>
          </a>
          <a class="google share-sns" href="javascript:;" data-type="google">
            <i class="icon icon-google"></i>
          </a>
        </div>
      </div>
    </span>
  </div>
</div>

<div class="page-modal wx-share js-wx-box">
    <a class="close js-modal-close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <div class="wx-qrcode"></div>
</div>

<div class="mask js-mask"></div>
      
      <div class="clearfix"></div>
    </div>
  </div>
      
      <!--文章底部-->
      <div style="font-size:12px;border-bottom: #ddd 1px solid; BORDER-LEFT: #ddd 1px solid; BACKGROUND: #f6f6f6; MIN-HEIGHT: 120px; BORDER-TOP: #ddd 1px solid; BORDER-RIGHT: #ddd 1px solid">
	<div style="MARGIN-TOP: 5px; MARGIN-BOTTOM: 5px; FLOAT: left; MARGIN-LEFT: 5px; MARGIN-RIGHT: 10px">
		<div style="text-align:center">
			扫描微信关注我<br>
			<img alt="微信公众号二维码" title="微信公众号二维码" src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/weixin_qr_code.jpg" height="90" />
		</div>
	</div>
	<div style="LINE-HEIGHT: 200%; MARGIN-TOP: 10px; COLOR: #000000">
		本文链接：<a href="/2018/01/02/浅谈偏向锁、轻量级锁、重量级锁/">浅谈偏向锁、轻量级锁、重量级锁</a><br/>
		作者：<a title="点击联系我" href="mailto:monkeysayhi@163.com">猴子007</a><br/>
		出处：<a href="/">https://monkeysayhi.github.io</a><br/>
		本文基于<a target="_blank" title="Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)" href="http://creativecommons.org/licenses/by-sa/4.0/"> 知识共享署名-相同方式共享 4.0 </a>国际许可协议发布，欢迎转载，演绎或用于商业目的，但是必须保留本文的署名及链接。
	</div>
</div>
      
</article>

  
<nav id="article-nav">
  
    <a href="/2018/01/02/CAS中的ABA问题/" id="article-nav-newer" class="article-nav-link-wrap">
      <i class="icon-circle-left"></i>
      <div class="article-nav-title">
        
          CAS中的ABA问题
        
      </div>
    </a>
  
  
    <a href="/2017/12/28/一文解决内存屏障/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">一文解决内存屏障</div>
      <i class="icon-circle-right"></i>
    </a>
  
</nav>









      </div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2019 猴子007
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    <script>
	var yiliaConfig = {
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: "/",
		innerArchive: true
	}
</script>

<script src="/./main.js"></script>






    
<div class="tools-col">
  <ul class="btn-wrap">
    
      <li class="chose" data-hook="tools-section-all"><span class="text">全部</span><i class="icon-book"></i></li>
    
    
      <li data-hook="tools-section-tag"><span class="text">标签</span><i class="icon-price-tags"></i></li>
    
    
      <li data-hook="tools-section-friends"><span class="text">友链</span><i class="icon-link"></i></li>
    
    
      <li data-hook="tools-section-me"><span class="text">我</span><i class="icon-smile"></i></li>
    
  </ul>
  <div class="tools-wrap">
    
    	<section class="tools-section tools-section-all chose">
    	</section>
    

    
    	<section class="tools-section tools-section-tag">
    			<div class="widget tagcloud" id="js-tagcloud">
    				<a href="/tags/HDFS/" style="font-size: 16.15px;">HDFS</a> <a href="/tags/Hadoop/" style="font-size: 16.92px;">Hadoop</a> <a href="/tags/IDEA/" style="font-size: 10px;">IDEA</a> <a href="/tags/JVM/" style="font-size: 15.38px;">JVM</a> <a href="/tags/Java/" style="font-size: 18.46px;">Java</a> <a href="/tags/LintCode/" style="font-size: 13.08px;">LintCode</a> <a href="/tags/Linux/" style="font-size: 12.31px;">Linux</a> <a href="/tags/Mac/" style="font-size: 10px;">Mac</a> <a href="/tags/Python/" style="font-size: 10px;">Python</a> <a href="/tags/TCP/" style="font-size: 10.77px;">TCP</a> <a href="/tags/Yarn/" style="font-size: 11.54px;">Yarn</a> <a href="/tags/test/" style="font-size: 10px;">test</a> <a href="/tags/事务/" style="font-size: 10px;">事务</a> <a href="/tags/分布式/" style="font-size: 12.31px;">分布式</a> <a href="/tags/原创/" style="font-size: 20px;">原创</a> <a href="/tags/并发/" style="font-size: 17.69px;">并发</a> <a href="/tags/数据库/" style="font-size: 10.77px;">数据库</a> <a href="/tags/猿工/" style="font-size: 13.85px;">猿工</a> <a href="/tags/猿格/" style="font-size: 13.85px;">猿格</a> <a href="/tags/生活/" style="font-size: 10px;">生活</a> <a href="/tags/硬件/" style="font-size: 10px;">硬件</a> <a href="/tags/科普/" style="font-size: 12.31px;">科普</a> <a href="/tags/算法/" style="font-size: 13.85px;">算法</a> <a href="/tags/系统设计/" style="font-size: 10px;">系统设计</a> <a href="/tags/索引/" style="font-size: 10px;">索引</a> <a href="/tags/网络/" style="font-size: 10.77px;">网络</a> <a href="/tags/设计模式/" style="font-size: 14.62px;">设计模式</a> <a href="/tags/轮子/" style="font-size: 10px;">轮子</a> <a href="/tags/鉴赏/" style="font-size: 10px;">鉴赏</a> <a href="/tags/随笔/" style="font-size: 10.77px;">随笔</a> <a href="/tags/面试/" style="font-size: 19.23px;">面试</a>
    			</div>
    	</section>
    

    
    	<section class="tools-section tools-section-friends">
  		
  			<div class="friends-wrap" id="js-friends">
  			
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://www.jianshu.com/u/e94a22a2b6f1/">简书</a>
  	        
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="https://juejin.im/user/59cf5ebef265da0672286a9a/">掘金</a>
  	        
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://spy19930412.github.io/">Jane_s_blog</a>
  	        
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://zongwenlong.github.io/">All_is_well</a>
  	        
  	        </div>
  		
    	</section>
    

    
    	<section class="tools-section tools-section-me">
  	  	
  	  		<div class="aboutme-wrap" id="js-aboutme">我是猴子007，&lt;br&gt;一只非常特殊的动物，&lt;br&gt;可以从事程序的开发、维护，&lt;br&gt;经常因寻找香蕉或母猿而无心工作。</div>
  	  	
    	</section>
    
  </div>
  
</div>
    <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>
  </div>
</body>
</html>