<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <!-- redirect begin -->
  <!-- redirect end -->
  
  <meta name="renderer" content="webkit">
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <link rel="dns-prefetch" href="https://monkeysayhi.github.io">
  <title>消灭人类暴政，世界属于三体 | 程序猿说你好</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x6709;&amp;#x8FD9;&amp;#x6837;&amp;#x4E00;&amp;#x4E2A;&amp;#x7B11;&amp;#x8BDD;&amp;#xFF1A;  

&amp;#x7A0B;&amp;#x5E8F;&amp;#x733F;&amp;#x8FFD;&amp;#x6C42;&amp;#x4E00;&amp;#x7F8E;&amp;#x5973;&amp;#x3002;&amp;#x7F8E;&amp;#x5973;&amp;#xFF1A;&amp;#x4F60;&amp;#x80FD;&amp;#x8BA9;&amp;#x8FD9;&amp;#x4">
<meta property="og:type" content="article">
<meta property="og:title" content="消灭人类暴政，世界属于三体">
<meta property="og:url" content="https://monkeysayhi.github.io/2016/12/01/消灭人类暴政，世界属于三体/index.html">
<meta property="og:site_name" content="程序猿说你好">
<meta property="og:description" content="&amp;#x6709;&amp;#x8FD9;&amp;#x6837;&amp;#x4E00;&amp;#x4E2A;&amp;#x7B11;&amp;#x8BDD;&amp;#xFF1A;  

&amp;#x7A0B;&amp;#x5E8F;&amp;#x733F;&amp;#x8FFD;&amp;#x6C42;&amp;#x4E00;&amp;#x7F8E;&amp;#x5973;&amp;#x3002;&amp;#x7F8E;&amp;#x5973;&amp;#xFF1A;&amp;#x4F60;&amp;#x80FD;&amp;#x8BA9;&amp;#x8FD9;&amp;#x4">
<meta property="og:image" content="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/消灭人类暴政，世界属于三体/cover.jpg">
<meta property="og:updated_time" content="2017-10-11T02:24:55.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="消灭人类暴政，世界属于三体">
<meta name="twitter:description" content="&amp;#x6709;&amp;#x8FD9;&amp;#x6837;&amp;#x4E00;&amp;#x4E2A;&amp;#x7B11;&amp;#x8BDD;&amp;#xFF1A;  

&amp;#x7A0B;&amp;#x5E8F;&amp;#x733F;&amp;#x8FFD;&amp;#x6C42;&amp;#x4E00;&amp;#x7F8E;&amp;#x5973;&amp;#x3002;&amp;#x7F8E;&amp;#x5973;&amp;#xFF1A;&amp;#x4F60;&amp;#x80FD;&amp;#x8BA9;&amp;#x8FD9;&amp;#x4">
<meta name="twitter:image" content="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/消灭人类暴政，世界属于三体/cover.jpg">
  
    <link rel="alternative" href="/atom.xml" title="程序猿说你好" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" href="/main.css">
  
<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'UA-89666809-1', 'auto');
ga('send', 'pageview');

</script>
<!-- End Google Analytics -->


</head>

<body>
  <div id="container">
    <div class="left-col">
      <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/avatar.jpg" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">猴子007</a></h1>
		</hgroup>

		
		<p class="header-subtitle">来了就是猿</p>
		

		<nav class="header-menu">
			<ul>
			
				<li><a href="/">主页</a></li>
	        
				<li><a href="/archives/">时间线</a></li>
	        
			</ul>
		</nav>
		<nav class="header-smart-menu">
	        
    		
    			
    			<a class="js-smart-menu" data-idx="0" href="javascript:void(0)">所有文章</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="1" href="javascript:void(0)">标签</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="2" href="javascript:void(0)">友链</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="3" href="javascript:void(0)">关于我</a>
    			
    			
            
		</nav>
		<nav class="header-nav">
			<div class="social">
				
					<a class="github" target="_blank" href="https://github.com/monkeysayhi" title="github"><i class="icon-github"></i></a>
		        
					<a class="rss" target="_blank" href="/atom.xml" title="rss"><i class="icon-rss"></i></a>
		        
					<a class="mail" target="_blank" href="mailto:monkeysayhi@163.com" title="mail"><i class="icon-mail"></i></a>
		        
			</div>
		</nav>
	</header>		
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"><i class="icon-sort"></i></div>
  		<h1 class="header-author js-mobile-header hide">猴子007</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				
					<img src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/avatar.jpg" class="js-avatar">
				
			</div>
			<hgroup>
			  <h1 class="header-author">猴子007</h1>
			</hgroup>
			
			<p class="header-subtitle">来了就是猿</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives/">时间线</a></li>
		        
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/monkeysayhi" title="github"><i class="icon-github"></i></a>
			        
						<a class="rss" target="_blank" href="/atom.xml" title="rss"><i class="icon-rss"></i></a>
			        
						<a class="mail" target="_blank" href="mailto:monkeysayhi@163.com" title="mail"><i class="icon-mail"></i></a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap">
        <article id="post-消灭人类暴政，世界属于三体" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      消灭人类暴政，世界属于三体
    </h1>
  

        <a href="/2016/12/01/消灭人类暴政，世界属于三体/" class="archive-article-date">
  	<time datetime="2016-12-01T08:36:27.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-12-01</time>
</a>

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7B11;&#x8BDD;&#xFF1A;  </p>
<blockquote>
<p>&#x7A0B;&#x5E8F;&#x733F;&#x8FFD;&#x6C42;&#x4E00;&#x7F8E;&#x5973;&#x3002;<br>&#x7F8E;&#x5973;&#xFF1A;&#x4F60;&#x80FD;&#x8BA9;&#x8FD9;&#x4E2A;&#x8BBA;&#x575B;&#x7684;&#x4EBA;&#x90FD;&#x5435;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x4ECA;&#x665A;&#x5C31;&#x8DDF;&#x4F60;&#x8D70;&#x3002;<br>&#x4E8E;&#x662F;&#xFF0C;&#x7A0B;&#x5E8F;&#x733F;&#x5728;&#x8BBA;&#x575B;&#x4E0A;&#x8BF4;&#x9053;&#xFF1A;PHP&#x662F;&#x6700;&#x597D;&#x7684;&#x8BED;&#x8A00;&#xFF01;<br>&#x8BBA;&#x575B;&#x70B8;&#x9505;&#x4E86;&#xFF0C;&#x5404;&#x79CD;&#x5435;&#x67B6;&#x3002;&#x3002;&#x3002;<br>&#x7F8E;&#x5973;&#xFF1A;&#x670D;&#x4E86;&#x4F60;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x8D70;&#x5427;&#x3002;&#x4ECA;&#x5929;&#x4F60;&#x60F3;&#x5E72;&#x5565;&#x90FD;&#x884C;&#x3002;<br>&#x7A0B;&#x5E8F;&#x733F;&#xFF1A;&#x4ECA;&#x5929;&#x4E0D;&#x884C;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x8981;&#x8BF4;&#x670D;&#x4ED6;&#x4EEC;&#xFF01;</p>
</blockquote>
<p>PHP&#x662F;&#x4E0D;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x597D;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6216;&#x8BB8;&#x6CA1;&#x6709;&#x7B54;&#x6848;&#x2014;&#x2014;&#x5F53;&#x7136;&#xFF0C;&#x7A0B;&#x5E8F;&#x733F;&#x80FD;&#x4E0D;&#x80FD;&#x8FFD;&#x5230;&#x5973;&#x5B69;&#x53EF;&#x80FD;&#x4E5F;&#x6CA1;&#x6709;&#x7B54;&#x6848;&#x3002;&#x4F46;&#x662F;&#xFF0C;<strong>&#x5982;&#x679C;&#x8BF4;&#x7A0B;&#x5E8F;&#x733F;&#x516C;&#x8BA4;&#x6700;&#x68D2;&#x7684;&#x4E2D;&#x6587;&#x79D1;&#x5E7B;&#x5C0F;&#x8BF4;&#xFF0C;&#x90A3;&#x5C31;&#x975E;&#x300A;&#x4E09;&#x4F53;&#x300B;&#x83AB;&#x5C5E;&#x4E86;</strong>&#x3002;</p>
<a id="more"></a>
<h1 id="&#x4ECB;&#x7ECD;"><a href="#&#x4ECB;&#x7ECD;" class="headerlink" title="&#x4ECB;&#x7ECD;"></a>&#x4ECB;&#x7ECD;</h1><p>&#x300A;&#x4E09;&#x4F53;&#x300B;&#xFF0C;&#x53C8;&#x79F0;&#x300A;&#x5730;&#x7403;&#x5F80;&#x4E8B;&#x4E09;&#x90E8;&#x66F2;&#x300B;&#xFF0C;&#x201C;&#x4E09;&#x4F53;&#x201D;&#x662F;&#x5176;&#x7B2C;&#x4E00;&#x90E8;&#x7684;&#x540D;&#x5B57;&#x3002;&#x4F5C;&#x8005;&#x5218;&#x6148;&#x6B23;&#xFF0C;&#x5C71;&#x897F;&#x5A18;&#x5B50;&#x5173;&#x7535;&#x5382;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x7A0B;&#x5E08;&#x2014;&#x2014;&#x9AD8;&#x7EA7;&#x7A0B;&#x5E8F;&#x733F;&#xFF0C;&#x64C5;&#x5199;&#x79D1;&#x5E7B;&#x5C0F;&#x8BF4;&#xFF0C;<strong>&#x4E2D;&#x56FD;&#x79D1;&#x5E7B;&#x5C0F;&#x8BF4;&#x6700;&#x9AD8;&#x5956;&#x661F;&#x4E91;&#x5956;</strong>&#x7684;&#x5F97;&#x4E3B;&#xFF0C;<strong>&#x56FD;&#x9645;&#x79D1;&#x5E7B;&#x5C0F;&#x8BF4;&#x6700;&#x9AD8;&#x5956;&#x96E8;&#x679C;&#x5956;</strong>&#x7684;&#x5F97;&#x4E3B;&#x3002;&#x5176;&#x4EE3;&#x8868;&#x4F5C;&#x8FD8;&#x6709;&#x300A;&#x7403;&#x72B6;&#x95EA;&#x7535;&#x300B;&#x3001;&#x300A;&#x6D41;&#x6D6A;&#x5730;&#x7403;&#x300B;&#x3001;&#x300A;&#x4E61;&#x6751;&#x6559;&#x5E08;&#x300B;&#x7B49;&#x3002;</p>
<p><img src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/&#x6D88;&#x706D;&#x4EBA;&#x7C7B;&#x66B4;&#x653F;&#xFF0C;&#x4E16;&#x754C;&#x5C5E;&#x4E8E;&#x4E09;&#x4F53;/cover.jpg" alt=""></p>
<h1 id="&#x5267;&#x60C5;&#x4ECB;&#x7ECD;"><a href="#&#x5267;&#x60C5;&#x4ECB;&#x7ECD;" class="headerlink" title="&#x5267;&#x60C5;&#x4ECB;&#x7ECD;"></a>&#x5267;&#x60C5;&#x4ECB;&#x7ECD;</h1><p>&#x5982;&#x679C;&#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x6982;&#x62EC;&#x4E09;&#x4F53;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x201C;&#x4E00;&#x573A;&#x6587;&#x9769;&#x5F15;&#x53D1;&#x7684;&#x4E16;&#x754C;&#x6BC1;&#x706D;&#x201D;&#x2014;&#x2014;&#x5F53;&#x7136;&#x4E0E;&#x5B9E;&#x9645;&#x5267;&#x60C5;&#x6709;&#x51FA;&#x5165;&#x3002;&#x6574;&#x4F53;&#x4E0A;&#x4ECE;&#x5730;&#x7403;&#x5185;&#x90E8;&#x7684;&#x77DB;&#x76FE;&#x3001;&#x6269;&#x5C55;&#x5230;&#x5730;&#x7403;&#x4EBA;&#x4E0E;&#x4E09;&#x4F53;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x77DB;&#x76FE;&#xFF0C;&#x6700;&#x540E;&#x6269;&#x5C55;&#x5230;&#x6574;&#x4E2A;&#x5B87;&#x5B99;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x77DB;&#x76FE;&#x3002;&#x4E16;&#x754C;&#x89C2;&#x5B8F;&#x5927;&#xFF0C;&#x5267;&#x60C5;&#x548C;&#x8BBE;&#x5B9A;&#x90FD;&#x5341;&#x5206;&#x7CBE;&#x5F69;&#x3002;</p>
<p>&#x4E09;&#x8A00;&#x4E24;&#x8BED;&#x8BB2;&#x4E0D;&#x5B8C;&#x4E00;&#x90E8;90&#x4E07;&#x5B57;&#x7684;&#x795E;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x770B;&#x4E2A;12&#x5206;&#x949F;&#x7684;&#x89C6;&#x9891;&#x4E86;&#x89E3;&#x4E0B;&#x5267;&#x60C5;&#x3002;<br><a href="https://v.qq.com/x/page/m0164hagtx4.html" target="_blank" rel="external">12&#x5206;&#x949F;&#x770B;&#x5B8C;90&#x4E07;&#x5B57;&#x79D1;&#x5E7B;&#x795E;&#x4F5C;&#x300A;&#x4E09;&#x4F53;&#x300B;</a></p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x7EC6;&#x81F4;&#x66F4;&#x957F;&#x7684;&#x7248;&#x672C;&#xFF0C;1&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x3002;</p>
<p><a href="http://v.youku.com/v_show/id_XMTcxNTI5ODU0MA==.html" target="_blank" rel="external">&#x3010;&#x6587;&#x66F0;&#x5C0F;&#x5F3A;&#x3011;&#x4E00;&#x5C0F;&#x65F6;&#x8BFB;&#x5B8C;&#x300A;&#x4E09;&#x4F53;1-2-3&#x300B; &#x4E5D;&#x5408;&#x4E00;&#x89C6;&#x9891;&#xFF01;&#xFF01;&#xFF01;</a></p>
<p>&#x5982;&#x679C;&#x770B;&#x5B8C;&#x89C6;&#x9891;&#x89C9;&#x5F97;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x53EF;&#x4EE5;&#x5230;&#x5404;&#x5927;&#x5E94;&#x7528;&#x5546;&#x5E97;&#x641C;&#x7D22;&#x201C;&#x4E09;&#x4F53;&#x201D;&#x4E0B;&#x8F7D;&#xFF0C;&#x6216;&#x8D2D;&#x4E70;&#x7535;&#x5B50;&#x4E66;&#x3001;&#x7EB8;&#x8D28;&#x4E66;&#x7B49;&#x3002;&#x6CE8;&#x610F;&#x603B;&#x5171;&#x6709;&#x4E09;&#x90E8;&#xFF1A;&#x7B2C;&#x4E8C;&#x90E8;&#x662F;&#x6700;&#x7CBE;&#x5F69;&#x7684;&#xFF1B;&#x7B2C;&#x4E00;&#x90E8;&#x53EF;&#x80FD;&#x7565;&#x6709;&#x67AF;&#x71E5;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x957F;&#xFF0C;&#x800C;&#x4E14;&#x5960;&#x5B9A;&#x4E86;&#x6574;&#x4E2A;&#x4E09;&#x90E8;&#x66F2;&#x7684;&#x57FA;&#x8C03;&#xFF0C;&#x4E3B;&#x8981;&#x4EBA;&#x7269;&#x6027;&#x683C;&#x548C;&#x57FA;&#x672C;&#x77DB;&#x76FE;&#x4E5F;&#x5728;&#x8FD9;&#x4E00;&#x90E8;&#x786E;&#x7ACB;&#xFF0C;&#x503C;&#x5F97;&#x4ED4;&#x7EC6;&#x4E00;&#x8BFB;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x770B;&#x5B8C;&#x4E86;&#x7B2C;&#x4E00;&#x90E8;&#x548C;&#x7B2C;&#x4E8C;&#x90E8;&#xFF0C;&#x4F60;&#x4F1A;&#x5FCD;&#x4E0D;&#x4F4F;&#x7EE7;&#x7EED;&#x770B;&#x7B2C;&#x4E09;&#x90E8;&#x7684;&#x3002;</p>
<h1 id="&#x91D1;&#x53E5;&#x8D4F;&#x6790;"><a href="#&#x91D1;&#x53E5;&#x8D4F;&#x6790;" class="headerlink" title="&#x91D1;&#x53E5;&#x8D4F;&#x6790;"></a>&#x91D1;&#x53E5;&#x8D4F;&#x6790;</h1><p>&#x5267;&#x60C5;&#x4E4B;&#x5916;&#xFF0C;&#x4E09;&#x4F53;&#x4E2D;&#x6D41;&#x884C;&#x7684;&#x91D1;&#x53E5;&#x4E5F;&#x662F;&#x6570;&#x4E0D;&#x80DC;&#x6570;&#x3002;&#x8FD9;&#x91CC;&#x6458;&#x6284;&#x4E00;&#x4E8C;&#x3002;</p>
<blockquote>
<p>&#x6BC1;&#x706D;&#x4F60;&#xFF0C;&#x4E0E;&#x4F60;&#x4F55;&#x5E72;&#x3002;</p>
</blockquote>
<p>&#x6BC1;&#x706D;&#x4F60;&#xFF0C;&#x56E0;&#x4E3A;&#x9ED1;&#x6697;&#x68EE;&#x6797;&#x6CD5;&#x5219;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x8C01;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x5584;&#x662F;&#x6076;&#xFF0C;&#x662F;&#x5F3A;&#x662F;&#x5F31;&#x3002;<br>&#x5B87;&#x5B99;&#x4E2D;&#x6CA1;&#x6709;&#x7231;&#x3002;</p>
<blockquote>
<p>&#x4E00;&#x5207;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x5BFC;&#x5411;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#xFF1A;&#x7269;&#x7406;&#x5B66;&#x4ECE;&#x6765;&#x5C31;&#x6CA1;&#x6709;&#x5B58;&#x5728;&#x8FC7;&#xFF0C;&#x5C06;&#x6765;&#x4E5F;&#x4E0D;&#x4F1A;&#x5B58;&#x5728;&#x3002;&#x6211;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x4E0D;&#x8D1F;&#x8D23;&#x4EFB;&#x7684;&#xFF0C;&#x4F46;&#x522B;&#x65E0;&#x9009;&#x62E9;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x53E5;&#x8BDD;&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F;&#xFF0C;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x7B56;&#x7565;&#x4ECE;&#x6765;&#x90FD;&#x6CA1;&#x6709;&#x5B58;&#x5728;&#x8FC7;&#xFF0C;&#x70B9;&#x51FB;&#x7387;&#x3001;&#x8BBF;&#x8D2D;&#x7387;&#x63D0;&#x5347;&#x4ECE;&#x6765;&#x4E0D;&#x662F;&#x4F60;&#x770B;&#x5230;&#x7684;&#x5FC5;&#x7136;&#xFF0C;&#x800C;&#x662F;&#x8D85;&#x8D8A;&#x4F60;&#x7684;&#x5076;&#x7136;&#x3002;&#xFF08;&#x4E4B;&#x524D;&#x5728;&#x7F8E;&#x56E2;&#x641C;&#x7D22;&#x7EC4;&#x5B9E;&#x4E60;&#x65F6;&#x6574;&#x7406;&#xFF09;</p>
<blockquote>
<p>&#x4F60;&#x7684;&#x65E0;&#x754F;&#x6765;&#x6E90;&#x4E8E;&#x65E0;&#x77E5;&#x3002;</p>
</blockquote>
<p>&#x4F46;&#x662F;&#x8FD9;&#x53E5;&#x8BDD;&#x53C8;&#x544A;&#x8BC9;&#x5927;&#x5927;&#x7684;&#x5B89;&#x6170;&#x4E86;&#x6211;&#x4EEC;&#x3002;&#x5C31;&#x7B97;&#x662F;&#x65E0;&#x77E5;&#x7ED9;&#x4E88;&#x7684;&#x65E0;&#x754F;&#xFF0C;&#x5B83;&#x8D77;&#x7801;&#x80FD;&#x8BA9;&#x6211;&#x5185;&#x5FC3;&#x5B89;&#x5B81;&#x3002;</p>
<blockquote>
<p>&#x4E00;&#x4E2A;&#x5927;&#x4EBA;&#x548C;&#x4E00;&#x4E2A;&#x5C0F;&#x5B69;&#x513F;&#x7AD9;&#x5728;&#x6B7B;&#x4E8E;&#x6B66;&#x6597;&#x7684;&#x7EA2;&#x536B;&#x5175;&#x5893;&#x524D;&#xFF0C;&#x90A3;&#x5B69;&#x5B50;&#x95EE;&#x5927;&#x4EBA;:&#x4ED6;&#x4EEC;&#x662F;&#x70C8;&#x58EB;&#x5417;&#xFF1F;&#x5927;&#x4EBA;&#x8BF4;&#x4E0D;&#x662F;&#xFF1B;&#x5B69;&#x5B50;&#x53C8;&#x95EE;:&#x4ED6;&#x4EEC;&#x662F;&#x654C;&#x4EBA;&#x5417;&#xFF1F;&#x5927;&#x4EBA;&#x8BF4;&#x4E5F;&#x4E0D;&#x662F;&#xFF1B;&#x5B69;&#x5B50;&#x518D;&#x95EE;&#xFF1A;&#x90A3;&#x4ED6;&#x4EEC;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5927;&#x4EBA;&#x8BF4;&#xFF1A;&#x2018;&#x662F;&#x5386;&#x53F2;&#x3002;&#x2019;</p>
</blockquote>
<p>&#x5C0F;&#x5B69;&#x5B50;&#x624D;&#x8BB2;&#x5BF9;&#x9519;&#xFF0C;&#x4E09;&#x4F53;&#x8BB2;&#x7684;&#x5C31;&#x662F;&#x51B0;&#x51B7;&#x7684;&#x5B87;&#x5B99;&#x89C4;&#x5F8B;&#x3002;&#x6BC1;&#x706D;&#x4F60;&#x7684;&#x6587;&#x660E;&#xFF0C;&#x4F60;&#x6BC1;&#x706D;&#x7684;&#x6587;&#x660E;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x5584;&#x6076;&#x7F8E;&#x4E11;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x662F;&#x9ED8;&#x9ED8;&#x9075;&#x5FAA;&#x7740;&#x5B87;&#x5B99;&#x5B66;&#x516C;&#x7406;&#x3002;&#x6587;&#x660E;&#x6CE8;&#x5B9A;&#x8981;&#x4E92;&#x76F8;&#x541E;&#x5E76;&#xFF0C;&#x4ECE;&#x9AD8;&#x7EF4;&#x843D;&#x5411;&#x4F4E;&#x7EF4;&#xFF0C;&#x76F4;&#x5230;&#x5B87;&#x5B99;&#x91CD;&#x542F;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6216;&#x8005;&#x7A0B;&#x5FC3;&#x5E76;&#x6CA1;&#x6709;&#x6BC1;&#x706D;&#x5730;&#x7403;&#xFF0C;&#x56E0;&#x4E3A;&#x5730;&#x7403;&#x6CE8;&#x5B9A;&#x6BC1;&#x706D;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x6211;&#x80FD;&#x591F;&#x62EF;&#x6551;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7231;&#x4E0A;&#x7684;&#x9065;&#x8FDC;&#x7684;&#x7F8E;&#x4E3D;&#x4E16;&#x754C;&#xFF0C;&#x90A3;&#x8FD9;&#x4E00;&#x8F88;&#x5B50;&#x81F3;&#x5C11;&#x6CA1;&#x6709;&#x767D;&#x6D3B;&#x3002;</p>
</blockquote>
<p>&#x5F53;&#x7A0B;&#x5FC3;&#x7684;&#x201C;&#x7231;&#x201D;&#x518D;&#x4E00;&#x6B21;&#x5C06;&#x4EBA;&#x7C7B;&#x63A8;&#x5411;&#x6BC1;&#x706D;&#x4E4B;&#x540E;&#xFF0C;&#x7A0B;&#x5FC3;&#x9009;&#x62E9;&#x62EF;&#x6551;&#x90A3;&#x9897;&#x4E91;&#x5929;&#x660E;&#x9001;&#x7ED9;&#x5979;&#x7684;&#x661F;&#x661F;&#x3002;&#x5728;&#x51B7;&#x51B0;&#x51B0;&#x7684;&#x5B87;&#x5B99;&#x5B66;&#x516C;&#x7406;&#x4E4B;&#x4E0B;&#xFF0C;&#x4E2A;&#x4F53;&#x4ECD;&#x7136;&#x6709;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x4EFB;&#x6027;&#x3002;&#x7A0B;&#x5FC3;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x7EF4;&#x5FB7;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x7F57;&#x8F91;&#x66F4;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x8C01;&#x90FD;&#x6CA1;&#x6709;&#x9519;&#x3002;</p>
<blockquote>
<p>&#x9ED1;&#xFF0C;&#x771F;&#x4ED6;&#x5988;&#x7684;&#x9ED1;&#x554A;&#x3002;</p>
</blockquote>
<p>&#x201C;&#x7EC8;&#x6781;&#x89C4;&#x5F8B;&#x201D;&#x53F7;&#x7684;&#x8230;&#x957F;&#x81EA;&#x6740;&#x524D;&#x6700;&#x540E;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x4E5F;&#x8BB8;&#x4ED6;&#x5F53;&#x65F6;&#x5DF2;&#x7ECF;&#x770B;&#x900F;&#x4E86;&#x5B87;&#x5B99;&#x7684;&#x9ED1;&#x6697;&#x68EE;&#x6797;&#x56FE;&#x666F;&#xFF1B;&#x5F53;&#x7F57;&#x8F91;&#x5E26;&#x5927;&#x53F2;&#x63A8;&#x5BFC;&#x8FD9;&#x4E00;&#x56FE;&#x666F;&#x65F6;&#xFF0C;&#x5927;&#x53F2;&#x5728;&#x9886;&#x609F;&#x7684;&#x90A3;&#x4E00;&#x523B;&#x4E5F;&#x8BF4;&#x51FA;&#x4E86;&#x540C;&#x6837;&#x7684;&#x8BDD;&#x3002;&#x8FD9;&#x8BA9;&#x9ED1;&#x6697;&#x68EE;&#x6797;&#x4E2D;&#x7684;&#x4EBA;&#x7A81;&#x7136;&#x5F00;&#x59CB;&#x5E86;&#x5E78;&#x81EA;&#x5DF1;&#x8FD8;&#x6CA1;&#x6709;&#x66B4;&#x9732;&#xFF0C;&#x4E5F;&#x7A81;&#x7136;&#x5F00;&#x59CB;&#x754F;&#x60E7;&#x9ED1;&#x6697;&#x7684;&#x672A;&#x6765;&#x3002;</p>
<blockquote>
<p>&#x524D;&#x8FDB;&#xFF01;&#x524D;&#x8FDB;&#xFF01;&#xFF01;&#x4E0D;&#x62E9;&#x624B;&#x6BB5;&#x5730;&#x524D;&#x8FDB;&#xFF01;&#xFF01;&#xFF01;</p>
</blockquote>
<p>&#x56E0;&#x4E3A;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x7A0B;&#x5FC3;&#x548C;&#x7EF4;&#x5FB7;&#x5851;&#x9020;&#x4E86;&#x9636;&#x68AF;&#x8BA1;&#x5212;&#xFF0C;&#x7A0B;&#x5FC3;&#x4EB2;&#x624B;&#x5C06;&#x9001;&#x5979;&#x661F;&#x661F;&#x3001;&#x6DF1;&#x7231;&#x5979;&#x4E00;&#x8F88;&#x5B50;&#x7684;&#x4E91;&#x5929;&#x660E;&#x63A8;&#x5411;&#x4E86;&#x9065;&#x8FDC;&#x7684;&#x4E09;&#x4F53;&#x4E16;&#x754C;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x6700;&#x540E;&#x9001;&#x7ED9;&#x5927;&#x5BB6;&#x5171;&#x52C9;&#x3002;</p>

      

      
        <div class="page-reward">
          <a href="javascript:;" class="page-reward-btn tooltip-top">
            <div class="tooltip tooltip-east">
            <span class="tooltip-item">
              赏
            </span>
            <span class="tooltip-content">
              <span class="tooltip-text">
                <span class="tooltip-inner">
                  <p class="reward-p"><i class="icon icon-quo-left"></i>make a better world for everyone<i class="icon icon-quo-right"></i></p>
                  <div class="reward-box">
                    
                    
                    <div class="reward-box-item">
                      <img class="reward-img" src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/weixin_pay_qr_code.png">
                      <span class="reward-type">微信</span>
                    </div>
                    
                  </div>
                </span>
              </span>
            </span>
          </div>
          </a>
        </div>
      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/原创/">原创</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/生活/">生活</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/鉴赏/">鉴赏</a></li></ul>
	</div>

      

      

      
        <div class="share-btn share-icons tooltip-left">
  <div class="tooltip tooltip-east">
    <span class="tooltip-item">
      <a href="javascript:;" class="share-sns share-outer">
        <i class="icon icon-share"></i>
      </a>
    </span>
    <span class="tooltip-content">
      <div class="share-wrap">
        <div class="share-icons">
          <a class="weibo share-sns" href="javascript:;" data-type="weibo">
            <i class="icon icon-weibo"></i>
          </a>
          <a class="weixin share-sns wxFab" href="javascript:;" data-type="weixin">
            <i class="icon icon-weixin"></i>
          </a>
          <a class="qq share-sns" href="javascript:;" data-type="qq">
            <i class="icon icon-qq"></i>
          </a>
          <a class="douban share-sns" href="javascript:;" data-type="douban">
            <i class="icon icon-douban"></i>
          </a>
          <a class="qzone share-sns" href="javascript:;" data-type="qzone">
            <i class="icon icon-qzone"></i>
          </a>
          <a class="facebook share-sns" href="javascript:;" data-type="facebook">
            <i class="icon icon-facebook"></i>
          </a>
          <a class="twitter share-sns" href="javascript:;" data-type="twitter">
            <i class="icon icon-twitter"></i>
          </a>
          <a class="google share-sns" href="javascript:;" data-type="google">
            <i class="icon icon-google"></i>
          </a>
        </div>
      </div>
    </span>
  </div>
</div>

<div class="page-modal wx-share js-wx-box">
    <a class="close js-modal-close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <div class="wx-qrcode"></div>
</div>

<div class="mask js-mask"></div>
      
      <div class="clearfix"></div>
    </div>
  </div>
      
      <!--文章底部-->
      <div style="font-size:12px;border-bottom: #ddd 1px solid; BORDER-LEFT: #ddd 1px solid; BACKGROUND: #f6f6f6; MIN-HEIGHT: 120px; BORDER-TOP: #ddd 1px solid; BORDER-RIGHT: #ddd 1px solid">
	<div style="MARGIN-TOP: 5px; MARGIN-BOTTOM: 5px; FLOAT: left; MARGIN-LEFT: 5px; MARGIN-RIGHT: 10px">
		<div style="text-align:center">
			扫描微信关注我<br>
			<img alt="微信公众号二维码" title="微信公众号二维码" src="https://raw.githubusercontent.com/monkeysayhi/HexoBlogOnGithub/master/qiniu/static/images/_common/weixin_qr_code.jpg" height="90" />
		</div>
	</div>
	<div style="LINE-HEIGHT: 200%; MARGIN-TOP: 10px; COLOR: #000000">
		本文链接：<a href="/2016/12/01/消灭人类暴政，世界属于三体/">消灭人类暴政，世界属于三体</a><br/>
		作者：<a title="点击联系我" href="mailto:monkeysayhi@163.com">猴子007</a><br/>
		出处：<a href="/">https://monkeysayhi.github.io</a><br/>
		本文基于<a target="_blank" title="Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)" href="http://creativecommons.org/licenses/by-sa/4.0/"> 知识共享署名-相同方式共享 4.0 </a>国际许可协议发布，欢迎转载，演绎或用于商业目的，但是必须保留本文的署名及链接。
	</div>
</div>
      
</article>

  
<nav id="article-nav">
  
    <a href="/2016/12/05/从Exchager数据交换到基于trade-off的系统设计/" id="article-nav-newer" class="article-nav-link-wrap">
      <i class="icon-circle-left"></i>
      <div class="article-nav-title">
        
          从Exchager数据交换到基于trade-off的系统设计
        
      </div>
    </a>
  
  
    <a href="/2016/12/01/已开通微信公众号/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">已开通微信公众号</div>
      <i class="icon-circle-right"></i>
    </a>
  
</nav>









      </div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2019 猴子007
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    <script>
	var yiliaConfig = {
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: "/",
		innerArchive: true
	}
</script>

<script src="/./main.js"></script>






    
<div class="tools-col">
  <ul class="btn-wrap">
    
      <li class="chose" data-hook="tools-section-all"><span class="text">全部</span><i class="icon-book"></i></li>
    
    
      <li data-hook="tools-section-tag"><span class="text">标签</span><i class="icon-price-tags"></i></li>
    
    
      <li data-hook="tools-section-friends"><span class="text">友链</span><i class="icon-link"></i></li>
    
    
      <li data-hook="tools-section-me"><span class="text">我</span><i class="icon-smile"></i></li>
    
  </ul>
  <div class="tools-wrap">
    
    	<section class="tools-section tools-section-all chose">
    	</section>
    

    
    	<section class="tools-section tools-section-tag">
    			<div class="widget tagcloud" id="js-tagcloud">
    				<a href="/tags/HDFS/" style="font-size: 16.15px;">HDFS</a> <a href="/tags/Hadoop/" style="font-size: 16.92px;">Hadoop</a> <a href="/tags/IDEA/" style="font-size: 10px;">IDEA</a> <a href="/tags/JVM/" style="font-size: 15.38px;">JVM</a> <a href="/tags/Java/" style="font-size: 18.46px;">Java</a> <a href="/tags/LintCode/" style="font-size: 13.08px;">LintCode</a> <a href="/tags/Linux/" style="font-size: 12.31px;">Linux</a> <a href="/tags/Mac/" style="font-size: 10px;">Mac</a> <a href="/tags/Python/" style="font-size: 10px;">Python</a> <a href="/tags/TCP/" style="font-size: 10.77px;">TCP</a> <a href="/tags/Yarn/" style="font-size: 11.54px;">Yarn</a> <a href="/tags/test/" style="font-size: 10px;">test</a> <a href="/tags/事务/" style="font-size: 10px;">事务</a> <a href="/tags/分布式/" style="font-size: 12.31px;">分布式</a> <a href="/tags/原创/" style="font-size: 20px;">原创</a> <a href="/tags/并发/" style="font-size: 17.69px;">并发</a> <a href="/tags/数据库/" style="font-size: 10.77px;">数据库</a> <a href="/tags/猿工/" style="font-size: 13.85px;">猿工</a> <a href="/tags/猿格/" style="font-size: 13.85px;">猿格</a> <a href="/tags/生活/" style="font-size: 10px;">生活</a> <a href="/tags/硬件/" style="font-size: 10px;">硬件</a> <a href="/tags/科普/" style="font-size: 12.31px;">科普</a> <a href="/tags/算法/" style="font-size: 13.85px;">算法</a> <a href="/tags/系统设计/" style="font-size: 10px;">系统设计</a> <a href="/tags/索引/" style="font-size: 10px;">索引</a> <a href="/tags/网络/" style="font-size: 10.77px;">网络</a> <a href="/tags/设计模式/" style="font-size: 14.62px;">设计模式</a> <a href="/tags/轮子/" style="font-size: 10px;">轮子</a> <a href="/tags/鉴赏/" style="font-size: 10px;">鉴赏</a> <a href="/tags/随笔/" style="font-size: 10.77px;">随笔</a> <a href="/tags/面试/" style="font-size: 19.23px;">面试</a>
    			</div>
    	</section>
    

    
    	<section class="tools-section tools-section-friends">
  		
  			<div class="friends-wrap" id="js-friends">
  			
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://www.jianshu.com/u/e94a22a2b6f1/">简书</a>
  	        
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="https://juejin.im/user/59cf5ebef265da0672286a9a/">掘金</a>
  	        
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://spy19930412.github.io/">Jane_s_blog</a>
  	        
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://zongwenlong.github.io/">All_is_well</a>
  	        
  	        </div>
  		
    	</section>
    

    
    	<section class="tools-section tools-section-me">
  	  	
  	  		<div class="aboutme-wrap" id="js-aboutme">我是猴子007，&lt;br&gt;一只非常特殊的动物，&lt;br&gt;可以从事程序的开发、维护，&lt;br&gt;经常因寻找香蕉或母猿而无心工作。</div>
  	  	
    	</section>
    
  </div>
  
</div>
    <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>
  </div>
</body>
</html>